{"from":1,"to":100,"currentPage":1,"total":327,"totalPages":4,"queryTime":"0.137","totalTime":"0.497","partial":false,"canonicalUrl":"/v1/products(manufacturer=\"dell\"&inStoreAvailability=true)?show=name,longDescription,salePrice,percentSavings,condition,features.feature,customerReviewAverage,customerReviewCount&sort=percentSavings.desc&pageSize=100&format=json&apiKey=dqyrzm8d558mmdvgjnbhc74m","products":[{"name":"Dell - Color Smart H625CDW Wireless Color All-In-One Printer","longDescription":"Create professional-looking documents at home with this Dell multifunction printer. The all-in-one design lets you scan, fax, print and copy color or black-and-white documents directly from popular cloud-based services, and the quick printing saves you time. This Dell multifunction printer is easy to install and launches with a simple swipe of the bright touch screen display.","salePrice":229.99,"percentSavings":"42.5","condition":"New","features":[{"feature":"Prints up to 25 ISO ppm in black and color\nSo you can rapidly generate documents. First page prints in as little as 12.0sec / 12.5sec (mono/color)"},{"feature":"Laser printers are best for high-volume printing\nThey handle large volumes quickly and at a low cost per page. Toner (powder) is used instead of ink, so you get smudge-free images and text."},{"feature":"4-in-1 functionality\nPrints, copies, scans and faxes to accommodate your business and personal needs."},{"feature":"Built-in wireless LAN (802.11b/g/n)\nEnsures fast data transfer from a wireless connection."},{"feature":"Network-ready with built-in 10/100/1000Base-TX\nEthernet interface for simple connection to your home or office network."},{"feature":"NFC (near-field communication) capability\nAllows you to print from enabled mobile devices with just a touch."},{"feature":"Mobile printing capability*\nPrint from your mobile device and from select online cloud services with Dell Document Hub app, Apple&#174; AirPrint&#8482; or Google Cloud Print 2.0."},{"feature":"600 dpi for good print quality\nSufficient resolution for producing good quality documents and photos."},{"feature":"4 individual print cartridges are economical\nOnly replace toner cartridges (black, cyan, magenta and yellow) when a color runs out."},{"feature":"Large paper trays for your high-volume printing\nReload less often with the 250-sheet input tray and 150-sheet output tray."},{"feature":"4.3\" touch screen display\nUse the intuitive touch screen to print, scan or copy documents directly from the printer."},{"feature":"2 USB ports and Ethernet port for simple connectivity\nOffers a standard connection to your PC or network printing."},{"feature":"Built-in duplex printing\nPrint on both sides of the page without turning it over manually, to minimize your printing costs and help the environment."},{"feature":"Copies up to 25 cpm in black, up to 25 cpm in color\nTo ensure efficient performance."},{"feature":"High-speed fax\nWith 33.6 Kbps modem to meet your office needs."},{"feature":"Apple, the Apple logo, iPod, iPad and Apple AirPrint are trademarks of Apple Computer, Inc., registered in the U.S. and other countries."},{"feature":"*Requires a high-speed Internet connection."},{"feature":"Print speeds vary with use. See manufacturer for info on print speeds."}],"customerReviewAverage":4.50,"customerReviewCount":2},{"name":"Dell - S2318HN 23\" IPS LED FHD Monitor - Black","longDescription":"See stunning images in Full HD with this 23-inch Dell LED monitor. Its ultrathin bezel and IPS panel with a 178-degree viewing angle lets you work without missing any details on the screen. This TUV-certified Dell LED monitor helps prevent eyestrain from long hours of browsing thanks to its ComfortView feature.","salePrice":104.99,"percentSavings":"41.67","condition":"New","features":[],"customerReviewAverage":4.70,"customerReviewCount":143},{"name":"Dell - E525w Wireless Color All-in-One Laser Printer - Black","longDescription":"Dell E525w All-in-One Printer: Complete office tasks with ease using a printer that also copies, scans and faxes photos and documents. A wireless LAN makes it easy to connect your mobile devices, so you can print directly from apps like Dell Document Hub.","salePrice":199.99,"percentSavings":"39.4","condition":"New","features":[{"feature":"Laser printers are best for high-volume printing\nThey handle large volumes quickly and at a low cost per page. Toner (powder) is used instead of ink, so you get smudge-free images and text."},{"feature":"Wireless and mobile printing capability\nConnect this printer to your network with the built-in Ethernet or wireless LAN. Plus, print from your mobile device with the Dell Document Hub app, Google Cloud Print, Mopria or Apple&#174; AirPrint."},{"feature":"Up to 600 dpi (dots per inch) for good print quality\nSufficient resolution for producing good quality documents and photos."},{"feature":"Black and color cartridges\nAllow you to start producing documents and photos right away."},{"feature":"Large paper trays for high-volume printing and copying\nReload less often with the 150-sheet input tray and 100-sheet output bin. Copy or scan multiple pages easily with the 15-sheet automatic document feeder."},{"feature":"1 USB port for simple connectivity\n1 high-speed USB 2.0 port offers a standard connection to your computer."},{"feature":"More print, copy, scan and fax solutions\nScan documents to your computer, send quick faxes and more."},{"feature":"Apple, the Apple logo, iPod, iPad and Apple AirPrint are trademarks of Apple Computer, Inc., registered in the U.S. and other countries."},{"feature":"*Requires a high-speed Internet connection."},{"feature":"Print speeds vary with use. See manufacturer for info on print speeds."}],"customerReviewAverage":4.30,"customerReviewCount":37},{"name":"Dell - Precision 15 5000 Series 15.6\" Laptop - Intel Core i7 - 8GB Memory - 256GB Solid State Drive","longDescription":"Dell Precision 15 5000 Series Laptop: Enjoy the power to run CAD or CGI apps with this 15.6-inch Dell Precision laptop. The NVIDIA Quadro graphics card lets you clearly display complex images on the vivid screen. With a Core i7 and 256GB solid-state drive under the hood of this Dell Precision laptop, lag and stutter are a thing of the past.","salePrice":1817.99,"percentSavings":"36.46","condition":"New","features":[],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - Precision 15 5000 Series 15.6\" 4K Ultra HD Touch-Screen Laptop - Intel Core i7 - 8GB Memory - 512GB Solid State Drive","longDescription":"Dell Precision 15 5000 Series Laptop: Pack powerful computing with this 15.6-inch Dell Precision laptop. This thin, light computer provides portability, and the Intel Core i7 processor, 512GB solid-state drive and NVIDIA Quadro graphics card provide performance. Use the touch-screen display on this 15.6-inch Dell Precision laptop to control what's on the screen and the Thunderbolt port to attach peripherals.","salePrice":2392.99,"percentSavings":"35.76","condition":"New","features":[],"customerReviewAverage":4,"customerReviewCount":1},{"name":"Dell - C1760nw Wireless Color Printer - Black","longDescription":"With Clear View LED technology, this Dell C1760nw printer helps you create rich, vibrant documents. Built-in Wi-Fi allows you to wirelessly print from compatible Android and iOS mobile devices.","salePrice":179.99,"percentSavings":"35.72","condition":"New","features":[{"feature":"Prints up to 15 ISO ppm* in black, up to 12 ISO ppm* in color\nFirst page prints in as little as 19 seconds* in black and in as little as 23 seconds* in color."},{"feature":"Built-in wireless LAN (802.11b/g/n)\nEnsures fast data transfer from a wireless connection."},{"feature":"Network-ready with built-in 10/100Base-T Ethernet interface\nFor simple connection to your home or office network."},{"feature":"Clear View LED printing technology\nFeatures an intelligent self-scanning print head and enhanced image controller for high-quality prints."},{"feature":"Up to 600 x 600 dpi resolution\nWith up to 1200 dpi image quality for clear, readable prints."},{"feature":"Dell Mobile Print and Mobile Print App for Dell (download required)\nEnable you to print directly from compatible Android and iOS devices."},{"feature":"150-sheet input drawer and 10-sheet bypass tray\nMake it easy to complete large print jobs."},{"feature":"USB 2.0 connectivity\nFor simple connection to your computer."},{"feature":"PC system requirements\nWindows 2003 Server (32- or 64-bit), 2008 Server (32- or 64-bit), 2008 R2, 2012 Server (64-bit), XP Home or Pro (32- or 64-bit) or Vista Home Basic, Home Premium, Ultimate or Business (32- or 64-bit)."},{"feature":"Additional PC system requirements\nWindows 7 (32- or 64-bit) or 8 (32- or 64-bit)."},{"feature":"Mac system requirements\nOS 10.3.9 or later (Power PC 32-bit), 10.4.11 or later (Power PC 32-bit/Intel&#174; 32-bit) or 10.5 with latest update (Power PC 32- or 64-bit/Intel&#174; 32- or 64-bit)."},{"feature":"Additional Mac system requirements\n10.6 with latest update (Intel&#174; 32- or 64-bit) or 10.7 with latest update."},{"feature":"*Print speeds vary with use. See manufacturer for info on print speeds."},{"feature":"Apple, the Apple logo and iTunes are trademarks of Apple Computer, Inc., registered in the U.S. and other countries. iPod is a trademark of Apple Computer, Inc."},{"feature":"Intel, Pentium, Celeron, Centrino, Core, Viiv, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.70,"customerReviewCount":21},{"name":"Dell - XY7N4 Toner Cartridge - Yellow","longDescription":"This Dell XY7N4 V53F6 cartridge contains yellow toner, so you can produce up to 1,000 sharp, detailed prints using your Dell C1660w color laser printer.","salePrice":51.99,"percentSavings":"35.0","condition":"New","features":[{"feature":"Yields up to 1,000 pages"},{"feature":"Compatible with select Dell color laser printers: C1660w"},{"feature":"Yellow toner helps you create vibrant prints"}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - MY5TJ Toner Cartridge - Black","longDescription":"Compatible with select Dell color laser printers, this Dell MY5TJ N51XP toner cartridge allows you to print up to 3,000 pages for lasting use. The black toner allows you to produce documents with crisp, clear text.","salePrice":93.99,"percentSavings":"33.34","condition":"New","features":[{"feature":"Yields up to 3,000 pages"},{"feature":"Compatible with select Dell color laser printers: 2150cn, 2150cdn, 2155cn and 2155cdn"},{"feature":"Black toner produces rich, dark text"}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - 9X54J Toner Cartridge - Yellow","longDescription":"Add this yellow Dell 9X54J NPDXG toner cartridge to your compatible Dell laser printer to produce rich, vibrant prints. The toner cartridge yields up to 2,500 pages to suit your needs.","salePrice":97.99,"percentSavings":"30.0","condition":"New","features":[{"feature":"Yields up to 2,500 pages"},{"feature":"Compatible with select Dell laser printers: 2150cdn, 2150cn, 2155cdn and 2155cn"},{"feature":"Yellow toner helps you create vibrant prints"}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - S2718D 27\" IPS LED HD Monitor - Black","longDescription":"With Dell's InfinityEdge display, you'll enjoy an expansive entertainment experience without borders. A gorgeous, edge-to-edge viewing experience on this virtually borderless display ensures that you'll be immersed in the visuals, not distracted by the frame.This 27\" ultrathin monitor has an elegant and state-of-the-art design. The slim riser and sleek, metallic surface complement its premium performance and make it a perfect fit for various lifestyles and contemporary workspaces.","salePrice":499.99,"percentSavings":"28.57","condition":"New","features":[],"customerReviewAverage":5,"customerReviewCount":1},{"name":"Dell - S2718HN 27\" IPS LED FHD Monitor - Black","longDescription":"Enhance your computing experience with this 27-inch Dell InfinityEdge LED monitor. It lets you enjoy extended reading or media streaming with its ComfortView feature, and its AMD FreeSync technology provides lag-free gaming visuals. The IPS panel technology and 178-degree wide-viewing angle of this TUV-certified Dell InfinityEdge LED monitor optimizes your viewing experience.","salePrice":219.99,"percentSavings":"26.67","condition":"New","features":[],"customerReviewAverage":4.70,"customerReviewCount":30},{"name":"Dell - Power Companion Portable Charger - Black","longDescription":"Keep your laptop powered on the go with this Dell Power Companion 451BBSQ portable charger, which features 2 USB ports to also charge up to 2 mobile devices simultaneously. A 5-segment LED indicator lets you know how much power is left.","salePrice":107.99,"percentSavings":"26.53","condition":"New","features":[{"feature":"Compatible with select Dell laptops and most USB-chargeable devices\nTo simultaneously power your laptop, smartphone and tablet. Requires a Dell power adapter to recharge."},{"feature":"2 USB ports\nLet you connect up to 2 mobile devices at a time for quick charging."},{"feature":"12000 mAh capacity\nEnsures a steady stream of power to your devices."},{"feature":"5-segment LED indicator\nKeeps you aware of how much power is left."}],"customerReviewAverage":2,"customerReviewCount":1},{"name":"Dell - 24\" LED HD Monitor","longDescription":"Optimize your gaming experience with this Dell gaming monitor. Two HDMI ports let you switch easily from gaming console to PC mode. The wide-angle matte screen reduces glare and reflection, letting you view games and videos more clearly. This Dell gaming monitor has a sleek, solid stand for comfortable, stable gaming.","salePrice":139.99,"percentSavings":"26.32","condition":"New","features":[{"feature":"Ultrafast 2 ms response time\nAllows pixels to change colors quickly to avoid streaking, blurring and ghosting in fast-moving scenes and video games."},{"feature":"24\" widescreen flat-panel LED monitor\nProvides a large viewing area and clear images."},{"feature":"8,000,000:1 dynamic contrast ratio (1000:1 typical)\nProvides a high number of shades between black and white for accurate color reproduction when displaying images with extreme differences between light and dark."},{"feature":"300 cd/m&#178; brightness\nOffers an enhanced view, even in low lighting."},{"feature":"1920 x 1080 resolution at 60Hz\nDelivers crystal-clear picture quality with stunning detail."},{"feature":"170&#176; horizontal and 160&#176; vertical viewing angles\nEnsure a clear view of the monitor from multiple vantage points."},{"feature":"2 HDMI and VGA inputs\nAllow you to connect to a wide range of digital and analog devices."},{"feature":"ENERGY STAR certified\nDesigned to use less energy and meets strict energy efficiency guidelines set by the Environmental Protection Agency and U.S. Department of Energy."}],"customerReviewAverage":4.80,"customerReviewCount":6},{"name":"Dell - UltraSharp UP3216Q 31.5\" IPS LED 4K UHD Monitor - Black","longDescription":"With 4K Ultra HD resolution, this Dell UltraSharp UP3216Q LED monitor offers a life-like picture and broad coverage of industry color standards. An expansive 31.5\" screen makes multitasking easy.","salePrice":1328.99,"percentSavings":"26.17","condition":"New","features":[{"feature":"Ultrafast 6 ms response time in fast mode and 8 ms response time in normal mode\nLet you play video games and watch movies and TV with minimal streaking or blurring."},{"feature":"31.5\" LED screen with IPS technology\nAllows easy multitasking and vivid picture clarity."},{"feature":"2,000,000:1 dynamic contrast ratio (1000:1 typical)\nProvides deep blacks and bright whites for an immersive viewing experience."},{"feature":"300 cd/m&#178; brightness\nEnables easy viewing in a range of lighting situations."},{"feature":"3840 x 2160 maximum resolution\nOffers clear, detailed image quality."}],"customerReviewAverage":5,"customerReviewCount":1},{"name":"Dell - 4J0X7 Toner Cartridge - Magenta","longDescription":"Easily produce sharp, detailed prints using this Dell 4J0X7 V3W4C toner cartridge, which works with Dell C1660w color laser printers and yields up to 1,000 pages to suit your needs.","salePrice":59.99,"percentSavings":"25.0","condition":"New","features":[{"feature":"Yields up to 1,000 pages"},{"feature":"Compatible with select Dell color laser printers: C1660w"},{"feature":"Magenta toner helps you create vibrant prints"}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - 5R6J0 Toner Cartridge - Cyan","longDescription":"Print out images with bright, brilliant color with this Dell 5R6J0 DWGCP toner cartridge, which features cyan toner for vibrant hues. The cartridge yields up to 1,000 pages for reliable performance.","salePrice":59.99,"percentSavings":"25.0","condition":"New","features":[{"feature":"Yields up to 1,000 pages"},{"feature":"Compatible with select Dell color laser printers: C1660w"},{"feature":"Cyan toner helps you create vibrant prints"}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - XPS 15.6\" 4K Ultra HD Touch-Screen Laptop - Intel Core i7 - 16GB Memory - 1TB Solid State Drive - Silver","longDescription":"Dell XPS Laptop: Maneuver through games or design your own virtual worlds with this laptop, which offers stunning 4K Ultra HD resolution and 2GB dedicated NVIDIA graphics for smooth, detailed images and gameplay. The InfinityEdge touch screen makes navigation simple, and the Thunderbolt port enables high-speed connection to an external display.","salePrice":1649.99,"percentSavings":"25.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" 4K UHD touch screen for hands-on control\nNatural finger-touch navigation makes the most of Windows 10. The 3840 x 2160 resolution boasts brilliant color and clarity. InfinityEdge technology offers an expanded viewing area."},{"feature":"6th Gen Intel&#174; Core&#8482; i7-6700HQ processor\nPowerful quad-core, eight-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it, while increasing energy efficiency when you don't."},{"feature":"16GB system memory for intense multitasking and gaming\nReams of high-bandwidth DDR4 RAM to smoothly run your graphics-heavy PC games and video-editing applications, as well as numerous programs and browser tabs all at once."},{"feature":"1TB solid state drive (SSD)\nWhile offering less storage space than a hard drive, a flash-based SSD has no moving parts, resulting in faster start-up times and data access, no noise, and reduced heat production and power draw on the battery."},{"feature":"NVIDIA GeForce GTX 960M graphics\nBacked by 2GB GDDR5 dedicated video memory for a fast, advanced GPU to fuel your games."},{"feature":"Built-in stereo speakers\nMaxxAudio delivers great sound across music, movies, voice and games."},{"feature":"Weighs 4.4 lbs. and measures 0.66\" thin\nThin and light design with DVD/CD drive omitted for improved portability. 6-cell lithium-ion battery."},{"feature":"Machined aluminum finish\nCreates a sleek look and provides a rigid, lightweight frame."},{"feature":"Bluetooth 4.1 interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nUSB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds), and both features PowerShare for rapid charging."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Thunderbolt port for connecting advanced monitors and external drives\nThis single interface supports both high-speed data and high-def video &#8212; plus power over cable for bus-powered devices &#8212; ideal for digital content creators."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Next-generation wireless connectivity\nConnects to your network or hotspots on all current Wi-Fi standards. Connect to a Wireless-AC router for speed nearly 3x faster than Wireless-N."},{"feature":"Built-in HD webcam with microphone\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications. 720p resolution."},{"feature":"Backlit keyboard for easy typing in dim or dark locations\nType comfortably and maneuver through games with ease."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Additional ports\nMicrophone-in/headphone-out combo jack."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.30,"customerReviewCount":389},{"name":"Dell - USB 3.0 Docking Station - Black","longDescription":"Enhance your desktop or portable PC setup with this Dell 452BBPG USB 3.0 docking station, which features 3 USB 3.0 ports and 2 USB 2.0 ports for flexible connection to a wide variety of devices.","salePrice":127.99,"percentSavings":"24.71","condition":"New","features":[{"feature":"Compatible with most laptops\nIncluding a wide variety of Dell laptops and notebooks for wide-ranging use."},{"feature":"3 USB 3.0 ports and 2 USB 2.0 ports\nEnable connection to a wide array of peripherals, including monitors, printers and hard drives. High-speed connectivity allows use with 4K Ultra HD displays"},{"feature":"HDMI input, DisplayPort and audio line interfaces\nOffer flexible connectivity."},{"feature":"RJ-45 Ethernet port\nAllows you to connect network cables for high-speed Internet access."}],"customerReviewAverage":4.10,"customerReviewCount":17},{"name":"Dell - 7C6F7 Toner Cartridge - Black","longDescription":"Print out documents with crisp text with this Dell 7C6F7 4G9HP black toner cartridge, which yields up to 1,250 pages and is compatible with Dell C1660w color laser printers for reliable performance.","salePrice":54.99,"percentSavings":"23.61","condition":"New","features":[{"feature":"Yields up to 1,250 pages"},{"feature":"Compatible with select Dell color laser printers: C1660w"},{"feature":"Black toner for rich, dark text"}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - E310dw Wireless Black-and-White Laser Printer - Black","longDescription":"Dell E310dw Printer: With a wireless LAN and an Ethernet port, it's easy to connect this printer to your home or office network. You can also print directly from your smartphone or tablet with the Dell Document Hub app, Google Cloud Print, Mopria or Apple&#174; AirPrint.","salePrice":99.99,"percentSavings":"23.08","condition":"New","features":[{"feature":"Laser printers are best for high-volume printing\nThey handle large volumes quickly and at a low cost per page. Toner (powder) is used instead of ink, so you get smudge-free images and text."},{"feature":"Wireless and mobile printing capability\nConnect this printer to your network with the built-in Ethernet or wireless LAN. Plus, print from your mobile device with the Dell Document Hub app, Google Cloud Print, Mopria or Apple AirPrint."},{"feature":"Up to 2400 x 600 (dots per inch) dpi for good print quality\nSufficient resolution for producing good quality documents."},{"feature":"Single toner cartridge\nAllows you to start producing documents right away."},{"feature":"Large paper trays for your high-volume printing\nReload less often with the 250-sheet input tray, single-sheet feeder and 100-sheet output bin."},{"feature":"1-line LCD\nMakes operation simple."},{"feature":"1 USB port for simple connectivity\n1 high-speed USB 2.0 port offers a standard connection to your computer."},{"feature":"Built-in duplex printing\nPrint on both sides of the page without turning it over manually, so you can minimize your printing costs and help the environment."},{"feature":"Apple, the Apple logo, iPod, iPad and Apple AirPrint are trademarks of Apple Computer, Inc., registered in the U.S. and other countries."},{"feature":"*Requires a high-speed Internet connection."},{"feature":"Print speeds vary with use. See manufacturer for info on print speeds."}],"customerReviewAverage":4.30,"customerReviewCount":63},{"name":"Dell - 27\" LED GSync Monitor - Black","longDescription":"Delve deep into your favorite games with this Dell gaming monitor. Nvidia G-Sync technology minimizes stuttering and screen tearing for smooth graphics, and the adjustable display lets you customize your gaming setup for optimum comfort and visibility. Boasting a 27-inch screen, this Dell gaming monitor makes it easy to see minute details as you play.","salePrice":479.99,"percentSavings":"20.0","condition":"New","features":[{"feature":"2560 x 1440 resolution at 144Hz\nDelivers stunning high-definition visuals."},{"feature":"Ultrafast 1 ms response time\nAllows pixels to change colors quickly to avoid streaking, blurring and ghosting in fast-moving scenes and video games."},{"feature":"27\" widescreen flat-panel LED monitor\nProvides a large viewing area and clear images."},{"feature":"G-SYNC technology for smooth gameplay\nNVIDIA G-SYNC synchronizes the refresh rates between the GPU and display, eliminating screen tearing and minimizing display stutter and input lag."},{"feature":"HDMI and DisplayPort inputs\nAllow you to set up DVD players and other AV sources for a clear, high-quality audio and video signal."},{"feature":"4 USB 3.0 ports\nLet you access data stored on a compatible flash drive or connect a mouse, keyboard or other peripheral."},{"feature":"170&#176; horizontal and 160&#176; vertical viewing angles\nEnsure a clear view of the monitor from multiple vantage points."},{"feature":"1,000:1 contrast ratio\nProvides a high number of shades between black and white. This range enables accurate color reproduction when displaying images with extreme differences between light and dark for excellent picture quality."},{"feature":"350 cd/m&#178; brightness\nOffers an enhanced view, even in low lighting."},{"feature":"ENERGY STAR certified\nDesigned to use less energy and meets strict energy efficiency guidelines set by the Environmental Protection Agency and U.S. Department of Energy."}],"customerReviewAverage":4.60,"customerReviewCount":355},{"name":"Dell - Inspiron 15.6\" Laptop - Intel Core i3 - 6GB Memory - 1TB Hard Drive - Black","longDescription":"Dell Inspiron Laptop: Work and play with this 15.6-inch Dell Inspiron notebook computer. The Intel i3 processor is paired with 6GB of DDR4 RAM for speedy performance, while the HD display and stereo speakers with MaxxAudio provide crisp sound and sharp video. This Inspiron notebook computer has two USB 3.0 ports for fast data transfers to and from your other USB devices.","salePrice":279.99,"percentSavings":"20.0","condition":"New","features":[],"customerReviewAverage":4,"customerReviewCount":15},{"name":"Dell - UltraSharp U2415 24\" IPS LED HD Monitor - Black","longDescription":"With a fully adjustable stand and HDMI and DisplayPort inputs, this Dell UltraSharp U2415 PVJVW monitor enables a flexible dual-monitor setup for enhanced functionality. The vivid IPS display with 1920 x 1200 resolution offers bright, clear images.","salePrice":295.99,"percentSavings":"19.57","condition":"New","features":[{"feature":"Ultrafast 6 ms response time\nMinimizes blurring and ghosting for clarity during fast-moving scenes and games."},{"feature":"24\" antiglare flat-panel LED monitor\nSlim design and thin bezel offer clear visibility and enable an easy dual-monitor setup. Flexible stand features height adjustment and tilt and swivel capabilities for comfortable viewing and versatility."},{"feature":"Up to 300 cd/m&#178; brightness\nProvides vibrant color and detail for your favorite entertainment."},{"feature":"1920 x 1200 resolution\nHigh-definition picture quality for movies, photo editing and Web browsing. 178&#176; horizontal and vertical viewing angles offer clear visibility from any position."},{"feature":"HDMI and DisplayPort inputs\nAllow you to connect a variety of entertainment equipment. MHL connectivity lets you display content from your mobile device."}],"customerReviewAverage":4.50,"customerReviewCount":20},{"name":"Dell - THKJ8 Toner Cartridge - Cyan","longDescription":"With the ability to yield up to 2,500 colorful pages, this Dell THKJ8 769T5 toner cartridge ensures lasting use with your compatible Dell color laser printer. The cyan toner allows you to print documents with rich, bright hues.","salePrice":112.99,"percentSavings":"19.29","condition":"New","features":[{"feature":"Yields up to 2,500 pages"},{"feature":"Compatible with select Dell color laser printers: 2150cn, 2150cdn, 2155cn and 2155cdn"},{"feature":"Cyan toner helps you create vibrant prints"}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - 2Y3CM Toner Cartridge - Magenta","longDescription":"This Dell 2Y3CM 8WNV5 cartridge contains magenta toner, so you can easily produce up to 2,500 rich, vibrant prints using your compatible Dell color laser printer.","salePrice":112.99,"percentSavings":"19.29","condition":"New","features":[{"feature":"Yields up to 2,500 pages"},{"feature":"Compatible with select Dell color laser printers: 2150cdn, 2150cn, 2155cdn and 2155cn"},{"feature":"Magenta toner helps you create vibrant prints"}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - Inspiron 2-in-1 13.3\" Touch-Screen Laptop - Intel Core i5 - 8GB Memory - 256GB Solid State Drive - Gray","longDescription":"Only at Best Buy  Enjoy rapid computing response with this Dell Inspiron 13 5000 laptop. The 1080p resolution on the 13-inch touch screen makes it easy to see websites clearly, and you can use this laptop as a tablet. This Dell Inspiron 13 5000 laptop has an Intel processor and an infrared camera for powerful, versatile use.","salePrice":649.99,"percentSavings":"18.75","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"13.3\" Full HD touch screen for hands-on control\nThe 1920 x 1080 resolution boasts impressive color and clarity. Natural finger-touch navigation makes the most of Windows 10. IPS technology. WLED backlight."},{"feature":"7th Gen Intel&#174; Core&#8482; i5-7200U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"256GB solid state drive (SSD)\nWhile offering less storage space than a hard drive, a flash-based SSD has no moving parts, resulting in faster start-up times and data access, no noise, and reduced heat production and power draw on the battery."},{"feature":"360&#176; flip-and-fold design\nOffers versatile functionality with laptop, audience, tabletop, presentation and tablet modes."},{"feature":"Intel&#174; HD Graphics 620\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"MaxxAudio\nTo give you great sound across music, movies, voice and games."},{"feature":"Weighs 3.53 lbs. and measures 0.7\" thin\nUltraportable design, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 3-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. The USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity\nConnect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N. Backward-compatible with all other Wi-Fi networks and hotspots."},{"feature":"Built-in HD webcam with two microphones\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard\nAllows you to enjoy comfortable and accurate typing, even in dim lighting."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Additional port\nHeadphone/microphone combo jack."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.50,"customerReviewCount":816},{"name":"Dell - Inspiron 2-in-1 15.6\" Touch-Screen Laptop - Intel Core i5 - 8GB Memory - 256GB Solid State Drive - Gray","longDescription":"Only at Best Buy  Dell Inspiron Convertible 2-in-1 Laptop: Stay connected to social media with this 15-inch Dell Inspiron Starlord laptop. The Intel Core processor keeps the computer responsive, and 1080p touch screen makes it easy to use the laptop once it's converted to a tablet. An infrared camera on this Dell Inspiron Starlord laptop enhances functionality and supports bio security.","salePrice":649.99,"percentSavings":"18.75","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" Full HD touch screen for hands-on control\nThe 1920 x 1080 resolution boasts impressive color and clarity. Natural finger-touch navigation makes the most of Windows 10. IPS technology. LED backlight."},{"feature":"7th Gen Intel&#174; Core&#8482; i5-7200U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"256GB solid state drive (SSD)\nWhile offering less storage space than a hard drive, a flash-based SSD has no moving parts, resulting in faster start-up times and data access, no noise, and reduced heat production and power draw on the battery."},{"feature":"360&#176; flip-and-fold design\nOffers versatile functionality with laptop, audience, tabletop, presentation and tablet modes."},{"feature":"Intel&#174; HD Graphics 620\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"MaxxAudio\nTo give you great sound across music, movies, voice and games."},{"feature":"Weighs 4.83 lbs. and measures 0.7\" thin\nUltraportable design, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 3-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. The USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity\nConnect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N. Backward-compatible with all other Wi-Fi networks and hotspots."},{"feature":"Built-in HD webcam with two microphones\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard\nAllows you to enjoy comfortable and accurate typing, even in dim lighting."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Additional port\nHeadphone/microphone combo jack."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.50,"customerReviewCount":886},{"name":"Dell - Inspiron Desktop - Intel Core i3 - 8GB Memory - 1TB Hard Drive - Black","longDescription":"Dell Inspiron Desktop: Complete tasks on this Dell desktop computer. Its Intel Core i3 processor and 8GB of RAM reduces lag, so you can work more efficiently, and it has a 1TB hard drive, so you can store your media library. This Dell desktop computer runs Windows 10, ensuring access to the latest applications.","salePrice":349.99,"percentSavings":"18.61","condition":"New","features":[],"customerReviewAverage":4.60,"customerReviewCount":244},{"name":"Dell - UltraSharp U3417W 34.14\" LED Curved HD 21:9 Ultrawide Monitor - Black","longDescription":"Enjoy a high-quality viewing experience with this 34-inch Dell monitor. Its curved design, WQHD 3440 x 1440 resolution and flicker-free screen provide optimal eye comfort, while the Dell Easy Arrange feature lets you conveniently manage multiple applications on-screen. Dual 9W speakers and a panoramic view enhance your video streaming experience with this Dell monitor.","salePrice":824.99,"percentSavings":"17.5","condition":"New","features":[{"feature":"3440 x 1440 resolution at 60Hz\nDelivers stunning high-definition visuals."},{"feature":"5 ms response time\nHelps prevent blurring, ghosting and streaking during intense action sequences in video games and movies."},{"feature":"34.14\" antiglare widescreen curved LED monitor\nProvides a large viewing area and clear images."},{"feature":"HDMI, DisplayPort and Mini DisplayPort inputs\nAllow you to set up DVD players and other AV sources for a clear, high quality audio and video signal."},{"feature":"USB 3.0 port\nLets you access data stored on a compatible flash drive or connect a mouse, keyboard or other peripheral."},{"feature":"178&#176; horizontal and vertical viewing angles\nEnsure a clear view of the monitor from multiple vantage points."},{"feature":"Built-in 9W stereo speakers\nLet you enjoy your favorite entertainment in stereo sound."},{"feature":"1000:1 contrast ratio\nProvides a high number of shades between black and white. This range enables accurate color reproduction when displaying images with extreme differences between light and dark for excellent picture quality."},{"feature":"300 cd/m&#178; brightness\nOffers an enhanced view, even in low lighting."},{"feature":"See more at once\nPicture on picture mode allows you to view 2 images simultaneously."},{"feature":"ENERGY STAR certified\nDesigned to use less energy and meets strict energy efficiency guidelines set by the Environmental Protection Agency and U.S. Department of Energy."}],"customerReviewAverage":4.90,"customerReviewCount":25},{"name":"Dell - Inspiron 17.3\" Laptop - Intel Core i7 - 16GB Memory - AMD Radeon R7 M445 - 2TB Hard Drive - Gray","longDescription":"Explore the possibilities with this 17.3-inch Dell Inspiron laptop. The 2.70GHz dual-core i7 processor executes programs quickly and efficiently, and the 2TB hard drive provides sufficient room for important files. This Dell Inspiron laptop includes the Windows 10 Home operating system for increased productivity and compatibility with most new software programs.","salePrice":860.99,"percentSavings":"16.41","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"17.3\" Full HD display\nThe 1920 x 1080 resolution boasts impressive color and clarity. Energy-efficient LED backlight."},{"feature":"7th Gen Intel&#174; Core&#8482; i7-7500U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"16GB system memory for intense multitasking and gaming\nReams of high-bandwidth DDR4 RAM to smoothly run your graphics-heavy PC games and video-editing applications, as well as numerous programs and browser tabs all at once."},{"feature":"2TB hard drive for ample file storage space\nHolds a sizeable collection of digital photos, music, HD videos and DVD-quality movies. 5400 rpm spindle speed for standard read/write times."},{"feature":"AMD Radeon R7 M445 graphics\nBacked by 4GB GDDR5 dedicated video memory for a fast, advanced GPU to fuel your games."},{"feature":"MaxxAudio\nTo give you great sound across music, movies, voice and games."},{"feature":"Bluetooth 4.2 interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the desktop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Wireless network connectivity\nHigh-speed wireless LAN built into the screen, so it connects to your network or hotspots on the most common Wi-Fi standards in both laptop and tablet modes."},{"feature":"Built-in HD webcam with two microphones\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard\nAllows you to enjoy comfortable and accurate typing, even in dim lighting."},{"feature":"Basic software package included\n30-days trial of Microsoft Office."},{"feature":"Additional port\nHeadphone/microphone combo jack."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.50,"customerReviewCount":24},{"name":"Dell - Conference Room 54.6\" LED FHD Monitor - Black","longDescription":"Enjoy the vibrant LED display of this 55-inch Dell monitor. Its Full HD resolution delivers crisp visuals of photos and text, and it has a slim profile for flexible mounting options. This Dell monitor has two HDMI inputs for connecting external devices and includes a remote control for added convenience.","salePrice":1005.99,"percentSavings":"16.17","condition":"New","features":[],"customerReviewAverage":5,"customerReviewCount":1},{"name":"Dell - XN009 Toner Cartridge - Black","longDescription":"Print up to 2,000 pages with crisp, clear text with this Dell XN009 PK492 black toner cartridge that is compatible with select Dell color laser printers for lasting use and optimal performance.","salePrice":68.99,"percentSavings":"15.86","condition":"New","features":[{"feature":"Yields up to 2,000 pages"},{"feature":"Compatible with select Dell color laser printers: 2330dn, 2350d and 2350dn"},{"feature":"Black toner produces rich, dark text"}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - Ultrasharp 30\" IPS LED QHD Monitor - Black","longDescription":"Enjoy better-than-HD resolutions with this Dell 30-inch monitor. It gives you extreme detail with vibrant colors, and a rapid 6ms response rate ensures images appear virtually instantaneously without latency, making it ideal for gaming. Powerful IPS technology ensures this Dell 30-inch monitor produces deep contrasts and bright highlights from its large screen.","salePrice":1099.99,"percentSavings":"15.38","condition":"New","features":[{"feature":"QHD 2560 x 1600 maximum resolution\nOffers detailed, precise image quality."},{"feature":"6 ms response rate in fast mode and 8 ms response rate in normal mode\nHelps prevent blurring, ghosting and streaking during intense action sequences in video games and movies."},{"feature":"30\" LED-backlit screen with IPS technology\nProvides a large viewing area and clear images."},{"feature":"2 HDMI, DisplayPort and Mini DisplayPort inputs\nAllow you to set up DVD players and other AV sources for a clear, high quality audio and video signal."},{"feature":"4 USB 3.0 ports\nLet you access data stored on a compatible flash drive or connect a mouse, keyboard or other peripheral."},{"feature":"178&#176; horizontal and vertical viewing angles\nEnsure a clear view of the monitor from multiple vantage points."},{"feature":"1000:1 typical contrast ratio\nDelivers clear contrast with bright whites and deep blacks."},{"feature":"350 cd/m&#178; brightness\nOffers an enhanced view, even in low lighting."},{"feature":"Wide color coverage\nSupports major color space standards for Adobe RGB, sRGB, REC709 and DCI-P3."},{"feature":"A view tailored to you\nEasily display content from two PC sources with picture-by-picture and picture-in-picture features. Plus the KVM feature enables you to manage content with a single keyboard and mouse."},{"feature":"ENERGY STAR certified\nDesigned to use less energy and meets strict energy efficiency guidelines set by the Environmental Protection Agency and U.S. Department of Energy."}],"customerReviewAverage":5,"customerReviewCount":1},{"name":"Dell - UltraSharp U2417HJ 24\" IPS LED HD Monitor - Black","longDescription":"Make more efficient use of your desk space with this 24-inch Dell charging monitor. Use the built-in wireless charging stand in the base of this monitor to charge your Qi or PMA devices, removing the need for a separate charging station and cables. Enjoy the clear, crisp display on this highly adjustable Dell charging monitor.","salePrice":269.99,"percentSavings":"14.83","condition":"New","features":[{"feature":"1920 x 1080 resolution at 60Hz\nDelivers crystal-clear picture quality with stunning detail."},{"feature":"8 ms response time\nHelps prevent blurring, ghosting and streaking during intense action sequences in video games and movies."},{"feature":"24\" antiglare widescreen flat-panel IPS LED monitor\nProvides a large viewing area and clear images."},{"feature":"HDMI, DisplayPort and Mini DisplayPort inputs\nAllow you to set up DVD players and other AV sources for a clear, high quality audio and video signal."},{"feature":"4 USB 3.0 ports\nLet you access data stored on a compatible flash drive or connect a mouse, keyboard or other peripheral."},{"feature":"178&#176; horizontal and vertical viewing angles\nEnsure a clear view of the monitor from multiple vantage points."},{"feature":"2,000,000:1 dynamic contrast ratio (1000:1 typical)\nProvides a high number of shades between black and white for accurate color reproduction when displaying images with extreme differences between light and dark."},{"feature":"250 cd/m&#178; brightness\nFor a highly visible display and crisp on-screen images."},{"feature":"ENERGY STAR certified\nDesigned to use less energy and meets strict energy efficiency guidelines set by the Environmental Protection Agency and U.S. Department of Energy."}],"customerReviewAverage":5,"customerReviewCount":2},{"name":"Dell - 24\" LED QHD GSync Monitor - Black","longDescription":"Discover the power of extreme detail with this Dell 24-inch monitor. The 1440p resolution is ideal for high-intensity gaming, where that little bit of extra detail can make the difference between a win and a loss.","salePrice":428.99,"percentSavings":"14.2","condition":"New","features":[{"feature":"QHD 2560 x 1440 maximum resolution\nOffers detailed, precise image quality."},{"feature":"Ultrafast 1 ms response time\nAllows pixels to change colors quickly to avoid streaking, blurring and ghosting in fast-moving scenes and video games."},{"feature":"24\" widescreen flat-panel LED monitor\nProvides a large viewing area and clear images."},{"feature":"G-SYNC technology for smooth gameplay\nNVIDIA G-SYNC synchronizes the refresh rates between the GPU and display, eliminating screen tearing and minimizing display stutter and input lag."},{"feature":"HDMI and DisplayPort inputs\nAllow you to set up DVD players and other AV sources for a clear, high quality audio and video signal."},{"feature":"4 USB 3.0 ports\nLet you access data stored on a compatible flash drive or connect a mouse, keyboard or other peripheral."},{"feature":"170&#176; horizontal and 160&#176; vertical viewing angles\nEnsure a clear view of the monitor from multiple vantage points."},{"feature":"1000:1 contrast ratio\nProvides a high number of shades between black and white. This range enables accurate color reproduction when displaying images with extreme differences between light and dark for the excellent picture quality."},{"feature":"350 cd/m&#178; brightness\nOffers an enhanced view, even in low lighting."},{"feature":"Preset modes for RPG, FPS or RTS\nLet you find the optimal visual setting and customize with a click. Plus, with such an easy setup, you can spend more time gaming and less time reconfiguring your settings."},{"feature":"ENERGY STAR certified\nDesigned to use less energy and meets strict energy efficiency guidelines set by the Environmental Protection Agency and U.S. Department of Energy."}],"customerReviewAverage":4.70,"customerReviewCount":34},{"name":"Dell - Refurbished OptiPlex Desktop - Intel Core i5 - 8GB Memory - 1TB Hard Drive - Black","longDescription":"Work productively and efficiently with this small form factor Dell OptiPlex desktop. Its 1TB of storage provides space for Windows 10 Pro updates and large business files, and an Intel Core i5 processor along with 8GB of RAM let you multitask smoothly. The 10 USB ports can connect multiple peripheral devices to this refurbished Dell OptiPlex desktop.  Learn more about refurbished products &#8250;","salePrice":294.99,"percentSavings":"13.99","condition":"Refurbished","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, such as Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"3rd Gen Intel&#174; Core&#8482; i5-3470 processor\nSmart quad-core, four-way processing performance. Intel Turbo Boost technology delivers dynamic extra power when you need it, while increasing energy efficiency when you don't."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a significant collection of digital photos, music, HD videos and DVD-quality movies."},{"feature":"DVD/CD drive\nReads and writes to a variety of media formats, including DVD+R/RW, DVD-R/RW and CD-R/RW."},{"feature":"Slim tower design cuts down on bulk\nTower measures less than 4\" wide, so it requires less space in your gaming setup."},{"feature":"4 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 6 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Basic software package\nIncludes a 1-month trial of Microsoft Office 365."},{"feature":"Additional ports\n1 DisplayPort. 1 VGA (D-sub) output. 1 microphone jack. 1 headphone jack. 2 PS/2 port. 1 Serial port. Audio ports for line in and line out."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - XPS 15.6\" 4K Ultra HD Touch-Screen Laptop - Intel Core i7 - 32GB Memory - NVIDIA GeForce GTX 960M - 1TB SSD - Silver","longDescription":"Dell XPS Laptop: Enjoy the dual functionality of a laptop and tablet with this 15.6-inch Dell computer. Its responsive touch screen has an Ultra HD resolution for plenty of detail, and the quad-core Intel Core i7 processor and 32GB of RAM keep programs running smoothly. This Dell computer has a 1TB solid-state drive for ample file storage space and fast boot times.","salePrice":1979.99,"percentSavings":"13.91","condition":"New","features":[],"customerReviewAverage":5,"customerReviewCount":2},{"name":"Dell - 27\" IPS LED 4K UHD Monitor - Black","longDescription":"Boost your workspace with this powerful Dell 27-inch Ultra HD 4K monitor. Accurate color performance and 8 million high-contrast pixels make this versatile unit, which has a formidable 9mn response rate, ideal for graphics professionals and gamers. Enhanced with an anti-glare coating and equipped with an adaptable stand, this Dell 27-inch Ultra HD 4K monitor is an ergonomically sound choice.","salePrice":516.99,"percentSavings":"13.83","condition":"New","features":[],"customerReviewAverage":4.60,"customerReviewCount":27},{"name":"Dell - Inspiron 17.3\" Laptop - Intel Core i7 - 8GB Memory - AMD Radeon R7 M445 - 1TB Hard Drive - Gray","longDescription":"Dell Inspiron Laptop: Work with confidence with this Dell Inspiron laptop. It contains multiple components within its sleek, compact design, and it packs plenty of power with its Intel Core i7 processor and 8GB of DDR4 RAM. This Dell Inspiron laptop has a 17.3-inch screen for watching videos and a 1TB hard drive that can store thousands of files.","salePrice":777.99,"percentSavings":"13.56","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"17.3\" Full HD display\nThe 1920 x 1080 resolution boasts impressive color and clarity. Energy-efficient LED backlight."},{"feature":"7th Gen Intel&#174; Core&#8482; i7-7500U mobile processor\nUltra-low-voltage platform. Dual-core processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a sizeable collection of digital photos, music, HD videos and DVD-quality movies. 5400 rpm spindle speed for standard read/write times."},{"feature":"AMD Radeon R7 M445 graphics\nBacked by 4GB GDDR5 dedicated video memory for a fast, advanced GPU to fuel your games."},{"feature":"MaxxAudio\nTo give you great sound across music, movies, voice and games."},{"feature":"Weighs 6.81 lbs. and measures 1\" thin\nPrioritizes screen size without sacrificing portability, so you get lots of viewing space without the laptop being too hefty to move around. 3-cell lithium-ion battery."},{"feature":"Bluetooth 4.2 interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the desktop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Wireless network connectivity\nHigh-speed wireless LAN built into the screen, so it connects to your network or hotspots on the most common Wi-Fi standards in both laptop and tablet modes."},{"feature":"Built-in HD webcam with two microphones\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard\nAllows you to enjoy comfortable and accurate typing, even in dim lighting."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Additional port\nHeadphone/microphone combo jack."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.60,"customerReviewCount":12},{"name":"Dell - E-Port Plus Port Replicator for Select Dell Systems - Black","longDescription":"Achieve the perfect workstation with this Dell E-Port Plus 3316304 port replicator, which features a variety of connectors for linking up accessories and peripherals to your Dell system.","salePrice":159.99,"percentSavings":"13.51","condition":"New","features":[{"feature":"Compatible with select Dell systems\nIncluding Latitude E5440, Latitude E5540, Latitude E6440, Latitude E6540, Latitude E7240 and Latitude E7440."},{"feature":"Port replicator\nLets you connect a range of peripherals to your current system."},{"feature":"Various connectors\nIncluding 2 USB 3.0 ports, 3 USB 2.0 ports, 2 DisplayPort interfaces, 2 DVI connectors, a VGA connector and RJ-45 connector for wide-ranging use. DisplayPort 1.2 lets you daisy chain up to 4 displays via 1 connector."}],"customerReviewAverage":5,"customerReviewCount":1},{"name":"Dell - Inspiron 17.3\" Laptop - AMD A9-Series - 8GB Memory - 1TB Hard Drive - Gray","longDescription":"Work efficiently with this 17.3-inch Dell Inspiron laptop. The antiglare backlit display lets you view your screen from a variety of angles, and the Intel i7 processor offers a quick system boot for increased productivity. This Dell Inspiron laptop has 8GB of RAM that lets you perform a variety of everyday tasks at once without compromising performance.","salePrice":525.99,"percentSavings":"12.33","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"17.3\" display\n1600 x 900 resolution for high-quality images and fine detail. Energy-efficient LED backlight."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a sizeable collection of digital photos, music, HD videos and DVD-quality movies. 5400 rpm spindle speed for standard read/write times."},{"feature":"AMD Radeon R5\nIntegrated graphics chipset with shared video memory provides solid image quality for Internet use, movies, basic photo editing and casual gaming."},{"feature":"MaxxAudio\nTo give you great sound across music, movies, voice and games."},{"feature":"Weighs 6.24 lbs. and measures 1\" thin\nPrioritizes screen size without sacrificing portability, so you get lots of viewing space without the laptop being too hefty to move around. 3-cell lithium-ion battery."},{"feature":"Bluetooth 4.1 interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the desktop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Wireless network connectivity\nHigh-speed wireless LAN built into the screen, so it connects to your network or hotspots on the most common Wi-Fi standards in both laptop and tablet modes."},{"feature":"Additional port\nHeadphone/microphone combo jack."},{"feature":"AMD, AMD Arrow logo and combinations thereof are trademarks of Advanced Micro Devices, Inc."}],"customerReviewAverage":4.30,"customerReviewCount":10},{"name":"Dell - Inspiron 2-in-1 15.6\" Touch-Screen Laptop - Intel Core i5 - 8GB Memory - 256GB Solid State Drive - Silver","longDescription":"Dell Inspiron Convertible 2-in-1 Laptop: Take your work with you by using this 15.6-inch Dell Inspiron laptop. It's equipped with an Intel Core i5 processor and 8GB of DDR4 RAM to run the programs you need to achieve your tasks, and its 256GB solid-state drive boots your device quickly. This Dell Inspiron laptop has a USB 3.0 interface for quick data transfer.Learn more.","salePrice":729.99,"percentSavings":"12.05","condition":"New","features":[],"customerReviewAverage":5,"customerReviewCount":2},{"name":"Dell - S2415H 23.8\" IPS LED HD Monitor - Black","longDescription":"Featuring 1920 x 1080 maximum resolution, this Dell S2415H 3R3XN LED monitor presents stunningly realistic images in clear detail on its 23.8\" display. The virtually borderless, ultranarrow bezel delivers an enveloping widescreen viewing experience.","salePrice":193.99,"percentSavings":"11.82","condition":"New","features":[{"feature":"Ultrafast 6 ms response time (gray to gray)\nAllows pixels to change colors quickly to avoid streaking, blurring and ghosting in fast-moving scenes and video games."},{"feature":"23.8\" flat-panel LED\nOffers a large, easy-to-see display. The stand allows the display to be tilted up to 6&#176; forward or up to 22&#176; backward, so you can easily customize the viewing angle."},{"feature":"1000:1 contrast ratio (8,000,000:1 mega dynamic contrast ratio)\nProvides a high number of shades between black and white, enabling accurate color reproduction when displaying images with extreme differences between light and dark."},{"feature":"250 cd/m&#178; brightness\nFor a clear, highly visible display with colors that are rich, consistent and accurately reproduced."},{"feature":"1920 x 1080 maximum resolution at 60Hz in 16:9 format\nDelivers high-definition visuals, rendering your favorite media in sharp, vivid, cinema-quality detail."},{"feature":"178&#176; horizontal and vertical viewing angles\nAlong with IPS (in-plane switching) technology let you clearly see the screen from multiple vantage points."},{"feature":"HDMI with MHL capability\nAllows you to connect select smartphones, tablets and other handheld devices to the monitor and charge them simultaneously, so you can stream video and audio content directly from your device."},{"feature":"VESA 100mm x 100mm compliant\nEnables you to mount the monitor to a wall via an optional mounting kit (not included) or attach the monitor to an optional Dell single monitor arm (not included) for a clutter-free desktop."},{"feature":"Virtually borderless, ultranarrow bezel\nAllows you to place the monitor next to a 2nd monitor, so you can enjoy a seamless dual-monitor viewing experience (additional monitor not included)."},{"feature":"Built-in cable management\nCreates a neat, tidy appearance. The monitor is made from environmentally friendly materials, including post-consumer recycled products, BFR-/PVC-free laminates, arsenic-free glass and a mercury-free LED panel."},{"feature":"2 integrated 3W speakers\nProvide crisp, full-bodied sound."},{"feature":"PC compatible\nFor use with your existing computer."},{"feature":"ENERGY STAR certified\nDesigned to use less energy and meets strict energy efficiency guidelines set by the Environmental Protection Agency and U.S. Department of Energy."}],"customerReviewAverage":4.70,"customerReviewCount":1308},{"name":"Dell - UltraSharp U2417HWi 24\" IPS LED HD Monitor - Black","longDescription":"Untether yourself from your desktop computer with this 24-inch Dell wireless monitor. Wireless connectivity lets you place your monitor where it works best for you, not where the cable ends. Seamlessly connect this Dell wireless monitor to Windows or Android devices to work on both screens at once, providing for efficient multitasking and an expanded viewing surface.","salePrice":319.99,"percentSavings":"11.11","condition":"New","features":[{"feature":"1920 x 1080 resolution at 60Hz\nDelivers crystal-clear picture quality with stunning detail."},{"feature":"8 ms response time\nHelps prevent blurring, ghosting and streaking during intense action sequences in video games and movies."},{"feature":"24\" antiglare widescreen flat-panel IPS LED monitor\nProvides a large viewing area and clear images."},{"feature":"HDMI input\nAllows you to set up DVD players and other AV sources for a clear, high quality audio and video signal."},{"feature":"4 USB 3.0 ports\nLet you access data stored on a compatible flash drive or connect a mouse, keyboard or other peripheral."},{"feature":"178&#176; horizontal and vertical viewing angles\nEnsure a clear view of the monitor from multiple vantage points."},{"feature":"2,000,000:1 dynamic contrast ratio (1000:1 typical)\nProvides a high number of shades between black and white for accurate color reproduction when displaying images with extreme differences between light and dark."},{"feature":"250 cd/m&#178; brightness\nFor a highly visible display and crisp on-screen images."},{"feature":"ENERGY STAR certified\nDesigned to use less energy and meets strict energy efficiency guidelines set by the Environmental Protection Agency and U.S. Department of Energy."}],"customerReviewAverage":4,"customerReviewCount":2},{"name":"Dell - J95NM Toner Cartridge","longDescription":"Keep your printer ready to create striking color images with this Dell yellow toner cartridge. The convenient design makes it easy to install this cartridge, and the duty cycle yields up to 700 pages at 5 percent coverage to meet all your printing needs. Compatible with laser printers, this Dell yellow toner cartridge brings your photos and documents to life.","salePrice":49.99,"percentSavings":"10.72","condition":"New","features":[{"feature":"Compatible with select Dell printers\nIncluding 1250c, C1765nf, C1765nfw, 1350cnw and C1760nw."},{"feature":"Yields up to 700 pages\nLets you print a large document quantity."},{"feature":"Yellow toner cartridge\nProvides crisp, professional-quality images and documents."},{"feature":"The Standard Capacity Yellow Toner Cartridge from Dell is designed to work with the Dell C17XX, 1250/135X color printer. It produces high resolution printouts with impressively sharp images and text. This cartridge features a capacity of up to 700 pages."}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - 5GDTC Toner Cartridge - Magenta","longDescription":"Capable of yielding up to 1,400 pages, this Dell 5GDTC XMX5D toner cartridge accommodates your printing needs. The magenta toner lets you print images with rich hues from your compatible Dell color laser printer.","salePrice":62.99,"percentSavings":"10.0","condition":"New","features":[{"feature":"Yields up to 1,400 pages"},{"feature":"Compatible with select Dell color laser printers: C1760nw, C1765nf, C1765nfw"},{"feature":"Magenta toner helps you create vibrant prints"}],"customerReviewAverage":4.50,"customerReviewCount":2},{"name":"Dell - 3K9XM Toner Cartridge - Black","longDescription":"Produce documents with dark, crisp text with this Dell 3K9XM 810WH cartridge that features black toner for optimal results. The cartridge yields up to 2,000 pages for lasting use and is compatible with select Dell color laser printers.","salePrice":62.99,"percentSavings":"10.0","condition":"New","features":[{"feature":"Yields up to 2,000 pages"},{"feature":"Compatible with select Dell color laser printers: 1250c, 1350cnw, 1355cn, 1355cnw, C1760nw and C1765nf"},{"feature":"Black toner produces rich, dark text"}],"customerReviewAverage":4.90,"customerReviewCount":7},{"name":"Dell - DRYXV Toner Cartridge - Black","longDescription":"Create up to 2,500 pages of rich, dark text using this Dell DRYXV cartridge, which contains black toner and works with select Dell laser printers.","salePrice":79.99,"percentSavings":"9.69","condition":"New","features":[{"feature":"Yields up to 2,500 pages"},{"feature":"Compatible with select Dell laser printers: B1260dn, B1265dnf and B1265dfw"},{"feature":"Black toner helps create rich, dark text"}],"customerReviewAverage":4.50,"customerReviewCount":2},{"name":"Dell - S2316M 23\" IPS LED HD Monitor - Black","longDescription":"Enjoy a clear picture at your workstation with this Dell S2316M LED monitor, which features 1920 x 1080 maximum resolution and an ultrafast 6 ms gray-to-gray response time that let you watch your favorite movies and TV shows.","salePrice":162.99,"percentSavings":"9.44","condition":"New","features":[{"feature":"Ultrafast 6 ms gray-to-gray response time\nHelps minimize blurring and ghosting during fast-motion scenes and gaming sequences to ensure a clear picture."},{"feature":"23\" LED-backlit panel\nWith IPS (in-plane switching) technology and a glossy finish reduces reflections to promote a detailed view. The ultrathin bezel gives the monitor a sleek look."},{"feature":"8,000,000:1 dynamic contrast ratio (1000:1 typical)\nOffers a wide range of shades between black and white for stunning vibrancy."},{"feature":"250 cd/m&#178; brightness\nProvides a high level of image detail."},{"feature":"1920 x 1080 resolution at 60Hz\nCreates a Full HD picture, so you can watch your favorite high-def movies and TV shows."},{"feature":"178&#176; vertical and horizontal viewing angles\nOffer a clear view from multiple vantage points."},{"feature":"VGA and DVI-D (HDCP) interfaces\nAllow flexible connectivity."}],"customerReviewAverage":4.60,"customerReviewCount":1275},{"name":"Dell - Inspiron 2-in-1 15.6\" Touch-Screen Laptop - Intel Core i7 - 12GB Memory - 512GB Solid State Drive - Silver","longDescription":"Dell Inspiron Convertible 2-in-1 Laptop: Enjoy powerful and versatile performance with this Dell Inspiron notebook computer. The Intel i7 processor and 12GB of DDR4 RAM provide lag-free multitasking in a package that's less than an inch thick and weighs less than 5 lbs. This 15.6-inch touch-screen Dell Inspiron notebook computer offers increased security thanks to its infrared camera for facial recognition.Learn more.","salePrice":979.99,"percentSavings":"9.26","condition":"New","features":[],"customerReviewAverage":4.30,"customerReviewCount":3},{"name":"Dell - XPS 15.6\" 4K Ultra HD Touch-Screen Laptop - Intel Core i5 - 8GB Memory - 256GB Solid State Drive - Silver","longDescription":"Dell XPS Laptop: Navigate features easily using this laptop's 15.6\" touch screen, which displays graphics in ultrarealistic 4K Ultra HD resolution. Enjoy smooth performance as you browse the Web with next-gen wireless-AC networking and 8GB of memory.","salePrice":1546.99,"percentSavings":"9.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" 4K Ultra HD InfinityEdge touch screen\nTouch, tap, glide and make the most of Windows 10. 3840 x 2160 4K Ultra HD resolution produces lifelike images with impressive clarity and vivid colors."},{"feature":"6th Gen Intel&#174; Core&#8482; i5-6300HQ processor\nSmart dual-core, four-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it, while increasing energy efficiency when you don't."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"256GB solid state drive (SSD)\nWhile offering less storage space than a hard drive, a flash-based SSD has no moving parts, resulting in faster start-up times and data access, no noise, and reduced heat production and power draw on the battery."},{"feature":"NVIDIA GeForce GTX 960M graphics\nDriven by 2GB GDDR5 dedicated video memory to quickly render high-quality images for videos and games."},{"feature":"Built-in stereo speakers\nMaxxAudio is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 4.4 lbs. and measures 0.66\" thin\nThin and light design with DVD/CD drive omitted for improved portability. 6-cell lithium-ion battery."},{"feature":"Machined aluminum enclosure in prestige silver\nCreates a sophisticated look and provides a rigid but lightweight frame."},{"feature":"Bluetooth 4.1 interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. The USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Thunderbolt 3 port for connecting advanced monitors and external drives\nThis single interface supports both high-speed data and high-def video &#8212; plus power over cable for bus-powered devices &#8212; ideal for digital content creators."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Next-generation wireless connectivity\nConnects to your network or hotspots on all current Wi-Fi standards. Connect to a Wireless-AC router for speed nearly 3x faster than Wireless-N."},{"feature":"Built-in widescreen HD webcam with dual digital-array microphones\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications. Supports 720p content."},{"feature":"Backlit keyboard\nFor easy typing in dim or dark locations."},{"feature":"Additional ports\nHeadphone jack."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":5,"customerReviewCount":4},{"name":"Dell - Inspiron 17.3\" Laptop - AMD FX - 16GB Memory - 2TB Hard Drive - Gray","longDescription":"Work faster with this 17.3-inch Dell Inspiron laptop. It has 16GB of RAM for effortless multitasking and 2TB of storage to house large files and programs. This Dell Inspiron laptop has a quad-core processor for speedy functioning and a Windows 10 operating system to equip you for work or study.","salePrice":828.99,"percentSavings":"7.89","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"17.3\" Full HD display\nThe 1920 x 1080 resolution boasts impressive color and clarity. Energy-efficient LED backlight."},{"feature":"16GB system memory for intense multitasking and gaming\nReams of high-bandwidth DDR4 RAM to smoothly run your graphics-heavy PC games and video-editing applications, as well as numerous programs and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a sizeable collection of digital photos, music, HD videos and DVD-quality movies. 5400 rpm spindle speed for standard read/write times."},{"feature":"MaxxAudio\nTo give you great sound across music, movies, voice and games."},{"feature":"Weighs 6.24 lbs. and measures 1\" thin\nPrioritizes screen size without sacrificing portability, so you get lots of viewing space without the laptop being too hefty to move around. 3-cell lithium-ion battery."},{"feature":"Bluetooth 4.1 interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the desktop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Wireless network connectivity\nHigh-speed wireless LAN built into the screen, so it connects to your network or hotspots on the most common Wi-Fi standards in both laptop and tablet modes."},{"feature":"Basic software package included\n30-days trial of Microsoft Office."},{"feature":"Additional port\nHeadphone/microphone combo jack."},{"feature":"AMD, AMD Arrow logo and combinations thereof are trademarks of Advanced Micro Devices, Inc."}],"customerReviewAverage":4,"customerReviewCount":2},{"name":"Dell - Conference Room 69.5\" LED FHD Monitor - Black","longDescription":"Show crisp, bright presentations with this 70-inch Dell LED monitor. Its Full HD resolution provides a 176-degree viewing angle, ensuring everyone in the conference room has a clear view, and it has multiple USB and HDMI ports for connecting auxiliary devices easily. This Dell LED monitor has a slim profile for flexible wall mounting options.","salePrice":2649.99,"percentSavings":"7.83","condition":"New","features":[],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - Latitude 14\" Laptop - Intel Core i7 - 8GB Memory - 256GB Solid State Drive - Black","longDescription":"Work or play when you travel with this Dell Latitude laptop. A 14-inch screen creates a workable computer environment without adding too much bulk to your bag, and the hard drive and system memory support common professional and casual computing tasks. This Dell Latitude laptop has an antiglare screen and built-in camera for functional web conferencing.","salePrice":1605.99,"percentSavings":"7.17","condition":"New","features":[{"feature":"Microsoft Windows 7 operating system preinstalled\nIt's your PC simplified, with fewer steps between you and what you do, easy sharing of photos and videos, and multiple ways to personalize your experience."},{"feature":"14\" Full HD display\nThe 1920 x 1080 resolution boasts impressive color and clarity. Energy-efficient WLED backlight."},{"feature":"6th Gen Intel&#174; Core&#8482; i7-6600U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"256GB solid state drive (SSD)\nWhile offering less storage space than a hard drive, a flash-based SSD has no moving parts, resulting in faster start-up times and data access, no noise, and reduced heat production and power draw on the battery."},{"feature":"Intel&#174; HD Graphics 520\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Weighs 3.31 lbs. and measures 0.8\" thin\nUltrathin and ultralight for maximum portability, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 4-cell lithium-polymer battery."},{"feature":"Bluetooth 4.1 interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the desktop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"3 USB 3.0 ports maximize the latest high-speed devices\nUSB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD memory card formats."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity (2x2, 867 Mbps)\nConnect to a Wireless-AC router for nearly 6x the speed, more capacity and wider coverage than Wireless-N (150 Mbps). Backward-compatible with all other Wi-Fi networks and hotspots."},{"feature":"Backlit keyboard for easy typing in dim or dark locations\nTouchpad with scroll and multitouch capability."},{"feature":"Additional ports\nHeadphone/microphone combo jack and mini DisplayPort."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":5,"customerReviewCount":1},{"name":"Dell - Inspiron 23.8\" All-In-One - AMD E2-Series - 4GB Memory - 500GB Hard Drive - Black","longDescription":"Dell Inspiron All-in-One Computer: With a built-in webcam and Wireless-AC connectivity, this computer makes it easy to stay connected with friends online. Windows 10 enables simple menu navigation for everyday tasks.","salePrice":431.99,"percentSavings":"7.1","condition":"New","features":[{"feature":"Microsoft Windows 10 operating system\nWindows 10 brings back the popular Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"All-in-one design saves space and cuts clutter\nA full computer is housed inside the monitor, so you get all the power of a PC in a streamlined design that involves fewer cables and takes up less space on a desk, table or kitchen counter."},{"feature":"23.8\" Full HD display\nNative 1920 x 1080 resolution boasts impressive color and clarity. Energy-efficient LED backlight."},{"feature":"AMD E2-7110 accelerated processor\nDual-core processing. AMD E2 APU handles the AMD Radeon graphics alongside the central processor to balance the load, providing essential performance and productivity for the tasks you do the most."},{"feature":"4GB system memory for basic multitasking\nAdequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once."},{"feature":"DVD/CD burner\nReads and writes to a variety of media formats, including DVD+R/RW, DVD-R/RW and CD-R/RW."},{"feature":"500GB hard drive for serviceable file storage space\nHolds your growing collection of digital photos, music and videos. 5400 rpm spindle speed for standard read/write times."},{"feature":"Built-in webcam\nMakes it easy to video chat with friends and family or talk to colleagues over popular applications like Skype."},{"feature":"Built-in media reader for simple photo transfer\nSupports most standard media card formats."},{"feature":"4 USB ports\nQuick plug-and-play connectivity for your devices and accessories."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity (1x1, 433 Mbps)\nConnect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N (150 Mbps). Backward-compatible with all other Wi-Fi networks and hotspots."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the computer and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Built-in speakers\nWaves MaxxAudio delivers sound with great depth and clarity."},{"feature":"Additional ports\nHDMI output. HDMI input."},{"feature":"AMD, AMD Arrow logo and combinations thereof are trademarks of Advanced Micro Devices, Inc."}],"customerReviewAverage":3.80,"customerReviewCount":12},{"name":"Dell - Inspiron 15.6\" 4K Ultra HD Touch-Screen Laptop - Intel Core i7 - 8GB Memory - 1TB+8GB Hybrid Hard Drive - Gray","longDescription":"Dell Inspiron Touch-Screen Laptop: This laptop's impressive 4K Ultra HD touch screen is ideal for editing photos and videos and watching high-definition movies. Dedicated graphics ensure smooth performance for graphics-heavy games and applications, and the large 1TB hard drive features an 8GB cache for fast start-up times and easy access to programs.","salePrice":1022.99,"percentSavings":"7.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" 4K Ultra HD touch screen for hands-on control\nNatural finger-touch navigation makes the most of Windows 10. Impressive 3840 x 2160 resolution offers vivid clarity for your movies and games. Energy-efficient LED backlight."},{"feature":"6th Gen Intel&#174; Core&#8482; i7-6700HQ processor\nPowerful quad-core, eight-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it, while increasing energy efficiency when you don't."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"2-in-1 hybrid hard drive provides both size and speed\nIncorporates a large-capacity 1TB hard drive at 5400 rpm for ample storage, with an 8GB cache to speed up start times and accelerate frequently accessed data."},{"feature":"NVIDIA GeForce GTX 960M graphics\nDriven by 4GB dedicated video memory to quickly render high-quality images for videos and games."},{"feature":"Built-in stereo speakers\nWaves MaxxAudio Pro is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 4.53 lbs. and measures 1.04\" thin\nThin and light design with DVD/CD drive omitted for improved portability. 6-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"3 USB 3.0 ports maximize the latest high-speed devices\nUSB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD and MMC memory card formats."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity (1x1, 433 Mbps)\nConnect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N (150 Mbps). Backward-compatible with all other Wi-Fi networks and hotspots."},{"feature":"Built-in HD webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard for easy typing in dim or dark locations\nTouchpad offers simple navigation."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.50,"customerReviewCount":42},{"name":"Dell - Inspiron 17.3\" Laptop - Intel Core i5 - 8GB Memory - 1TB Hard Drive - Gray","longDescription":"Dell Inspiron Laptop: Replace your desktop with an elegant laptop, packed with performance features, that deliver a cinematic media experience. The brushed aluminum Inspiron houses a powerful processor, built-in optical drive, full-size HDMI port, USB 3.0 and SD card reader. Thinner and lighter, this laptop builds on a legacy of great design.","salePrice":610.99,"percentSavings":"6.72","condition":"New","features":[{"feature":"17.3\" display\nEnergy-efficient LED backlight."},{"feature":"7th Gen Intel&#174; Core&#8482; i5-7200U mobile processor\nUltra-low-voltage platform. Dual-core processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a sizeable collection of digital photos, music, HD videos and DVD-quality movies. 5400 rpm spindle speed for standard read/write times."},{"feature":"Intel&#174; HD Graphics 620\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"MaxxAudio\nTo give you great sound across music, movies, voice and games."},{"feature":"Weighs 6.81 lbs. and measures 1\" thin\nPrioritizes screen size without sacrificing portability, so you get lots of viewing space without the laptop being too hefty to move around. 3-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the desktop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Built-in HD webcam with two microphones\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Additional port\nHeadphone/microphone combo jack."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":3.80,"customerReviewCount":6},{"name":"Dell - Inspiron 23.8\" Touch-Screen All-In-One - Intel Core i7 - 12GB Memory - 1TB Hard Drive - Silver","longDescription":"Enjoy the latest applications on this Dell All-in-One computer. It has an Intel Core i7 processor and 12GB of RAM for hassle-free multitasking, and its 1TB hard drive stores your important files. This Dell All-in-One computer has a 4-in-1 multi-card reader, so you can transfer photos and videos from your camera or smartphone.","salePrice":979.99,"percentSavings":"6.67","condition":"New","features":[],"customerReviewAverage":4.60,"customerReviewCount":76},{"name":"Dell - XPS 15.6\" 4K Ultra HD Touch-Screen Laptop - Intel Core i7 - 16GB Memory - NVIDIA GeForce GTX 1050 - 512GB SSD - Silver","longDescription":"Dell XPS Laptop: Edit photographs and videos with this Dell laptop. Its 15.6-inch Ultra HD screen and NVIDIA GeForce GTX 1050 graphics card let you see the finest details, and its 512GB solid-state drive holds plenty of your files and documents. This Dell laptop includes 16GB of DDR4 RAM and a quad-core Intel Core i7 chip for smooth program operations.","salePrice":1866.99,"percentSavings":"6.65","condition":"New","features":[],"customerReviewAverage":4.20,"customerReviewCount":17},{"name":"Dell - Inspiron 2-in-1 15.6\" Touch-Screen Laptop - Intel Core i7 - 16GB Memory - 512GB Solid State Drive - Gray","longDescription":"Get more done with this 15.6-inch Dell Inspiron laptop. The Core i7 processor provides a fast and stable system, and the Windows 10 platform supplies the essential programs for everyday tasks. The 512GB solid-state drive ensures ample room for media files, and the 16GB of RAM on this Dell Inspiron laptop supports smooth multitasking.","salePrice":935.99,"percentSavings":"6.4","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" Full HD touch screen for hands-on control\nThe 1920 x 1080 resolution boasts impressive color and clarity. Natural finger-touch navigation makes the most of Windows 10. IPS technology. LED backlight."},{"feature":"7th Gen Intel&#174; Core&#8482; i7-7500U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"16GB system memory for intense multitasking and gaming\nReams of high-bandwidth DDR4 RAM to smoothly run your graphics-heavy PC games and video-editing applications, as well as numerous programs and browser tabs all at once."},{"feature":"512GB solid state drive (SSD)\nWhile offering less storage space than a hard drive, a flash-based SSD has no moving parts, resulting in faster start-up times and data access, no noise, and reduced heat production and power draw on the battery."},{"feature":"360&#176; flip-and-fold design\nOffers versatile functionality with laptop, audience, tabletop, presentation and tablet modes."},{"feature":"Intel&#174; HD Graphics 620\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Stream entertainment from your laptop to your TV\nIntel&#174; Wireless Display (c) wirelessly transmits content to your HDTV* &#8212; photos, music, Web videos, Internet TV &#8212; whether on the hard drive or online."},{"feature":"Weighs 4.59 lbs. and measures 0.8\" thin\nUltraportable design, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 3-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. The USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Dual-band wireless network connectivity\nBuilt-in high-speed wireless LAN built into the screen, so it connects to your network or hotspots on all current Wi-Fi standards in both laptop and tablet modes."},{"feature":"Built-in HD webcam with two microphones\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard\nAllows you to enjoy comfortable and accurate typing, even in dim lighting."},{"feature":"Basic software package included\n30-days trial of Microsoft Office."},{"feature":"Additional port\nHeadphone/microphone combo jack."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"*Requires a separate wireless display adapter (not included), such as NETGEAR Push2TV, or a TV or receiver with built-in Intel WiDi."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.80,"customerReviewCount":21},{"name":"Dell - XPS Desktop - Intel Core i5 - 8GB Memory - NVIDIA GeForce GTX 730 - 1TB Hard Drive - Black","longDescription":"Dell XPS Desktop: The XPS Tower is a desktop built to grow with you. The functional design features big power and an easy-open chassis for simple expandability.","salePrice":655.99,"percentSavings":"6.29","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"6th Gen Intel&#174; Core&#8482; i5-6400 processor\nSmart quad-core processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it, while increasing energy efficiency when you don't."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"DVD/CD burner\nReads and writes to a variety of media formats, including DVD+R/RW, DVD-R/RW and CD-R/RW."},{"feature":"1TB hard drive for immense file storage space\nHolds your extensive collection of digital photos, music, HD videos and DVD-quality movies."},{"feature":"NVIDIA GeForce GTX 730 graphics\nDriven by 2GB DDR3 dedicated video memory to quickly render high-quality images for videos and games."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"1 SuperSpeed 10Gbs USB 3.1 port\nUltra-fast data connections to transfer large files rapidly."},{"feature":"7 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Wireless and wired network connectivity\nBuilt-in high-speed wireless LAN connects to your network on the most common Wi-Fi standards. Gigabit Ethernet LAN port plugs into wired networks."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the desktop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"Additional ports\nMicrophone and headphone jacks. Subwoofer port."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.20,"customerReviewCount":5},{"name":"Dell - Latitude 14\" Laptop - Intel Core i5 - 8GB Memory - 500GB Hard Drive - Black","longDescription":"Dell Latitude Laptop: Conquer your workday with this Dell commercial laptop. Its Intel Core i5 processor is paired with 8GB of RAM to reduce lag time and increase productivity, and the 500GB hard drive stores documents, programs and media files. This Dell commercial laptop is equipped with Windows 7 Professional and has a 14-inch display that's great for watching movies.","salePrice":957.99,"percentSavings":"6.08","condition":"New","features":[{"feature":"Microsoft Windows 7 operating system preinstalled\nIt's your PC simplified, with fewer steps between you and what you do, easy sharing of photos and videos, and multiple ways to personalize your experience."},{"feature":"14\" Full HD display\nThe 1920 x 1080 resolution boasts impressive color and clarity. Energy-efficient WLED backlight."},{"feature":"6th Gen Intel&#174; Core&#8482; i5-6300U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"500GB hard drive for serviceable file storage space\nHolds your growing collection of digital photos, music and videos. 7200 rpm spindle speed enables rapid read/write times for handling large files and complex applications."},{"feature":"Intel&#174; HD Graphics 520\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Weighs 3.88 lbs. and measures 0.9\" thin\nUltrathin and ultralight for maximum portability, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 4-cell lithium-polymer battery."},{"feature":"Bluetooth 4.1 interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the desktop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"3 USB 3.0 ports maximize the latest high-speed devices\nUSB 3.0 ports is backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD memory card formats."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity\nConnect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N. Backward-compatible with all other Wi-Fi networks and hotspots. Gigabit Ethernet LAN port."},{"feature":"Backlit keyboard for easy typing in dim or dark locations\nTouchpad with scroll and multitouch capability."},{"feature":"Additional ports\nHeadphone/microphone combo jack and VGA port."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - Inspiron 15.6\" Laptop - Intel Core i3 - 8GB Memory - 1TB Hard Drive - Black","longDescription":"Dell Inspiron Laptop: Experience the intuitive interface of Windows 10 Home with this 15.6-inch Dell Inspiron laptop. It has a 1TB hard drive for plenty of file storage space, and its HDMI and USB 3.0 inputs let you connect external A/V devices. This Dell Inspiron laptop has an Intel Core i3 processor and 8GB of DDR4 RAM to keep multiple programs running smoothly.","salePrice":394.99,"percentSavings":"5.95","condition":"New","features":[],"customerReviewAverage":4.70,"customerReviewCount":3},{"name":"Dell - Inspiron 2-in-1 15.6\" Touch-Screen Laptop - Intel Core i5 - 8GB Memory - 1TB Hard Drive - Gray","longDescription":"Dell Inspiron Convertible 2-in-1 Laptop: Get your hands on a versatile 15\" laptop packed with features for an enjoyable multimedia experience. Kick back and watch your favorite shows, or connect to your favorite sites and more with a spacious and crisp screen that offers room for multiple viewers to share at once. Crisp details and vibrant colors shine through as you access videos, photos and more.","salePrice":709.99,"percentSavings":"5.33","condition":"New","features":[],"customerReviewAverage":5,"customerReviewCount":1},{"name":"Dell - Inspiron 23.8\" Touch-Screen All-In-One - Intel Core i7 - 12GB Memory - 1TB Hard Drive - Silver/Black","longDescription":"Dell Inspiron All-In-One Computer: With built-in Wireless-AC networking and a 23.8\" edge-to-edge touch screen, you can easily browse Web pages and swipe through programs. The generous 1TB hard drive offers ample room for pictures, videos and music, and an HDMI output lets you connect to your HDTV.","salePrice":949.99,"percentSavings":"5.0","condition":"New","features":[{"feature":"Microsoft Windows 10 operating system\nWindows 10 brings back the popular Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"All-in-one design saves space and cuts clutter\nSo you get all the power of a PC in a streamlined design that involves fewer cables and takes up less space on a desk, table or kitchen counter."},{"feature":"23.8\" Full HD edge-to-edge touch screen\nTap, touch and glide through features. 1920 x 1080 Full HD resolution offers a realistic picture. IPS (in-plane switching) technology for wide viewing angles."},{"feature":"6th Gen Intel&#174; Core&#8482; i7-6700T processor\nPowerful quad-core, eight-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it, while increasing energy efficiency when you don't."},{"feature":"12GB system memory for full-power multitasking\nPlenty of high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"DVD drive\nLets you create custom discs."},{"feature":"1TB hard drive for ample file storage space\nHolds a significant collection of digital photos, music, HD videos and DVD-quality movies."},{"feature":"4 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity (1x1, 433 Mbps)\nConnect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N (150 Mbps). Backward-compatible with all other Wi-Fi networks and hotspots."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the computer and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"Integrated speakers\nWaves MaxxAudio Pro delivers lush, detailed sound."},{"feature":"Additional ports\nHDMI output."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.50,"customerReviewCount":661},{"name":"Dell - Inspiron 2-in-1 13.3\" Touch-Screen Laptop - Intel Core i3 - 8GB Memory - 128GB Solid State Drive - Black","longDescription":"Dell Inspiron Convertible 2-in-1 Laptop: Stay connected with this Dell Inspiron 13 computer. An Intel Core i3 processor provides the power and performance needed to load apps, play games or edit photos, and the touch screen display with 10-finger capacitive touch lets you navigate the system easily. This Dell Inspiron 13 computer has a long battery life.","salePrice":569.99,"percentSavings":"5.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"13.3\" Full HD touch screen for hands-on control\nThe 1920 x 1080 resolution boasts impressive color and clarity. Natural finger-touch navigation makes the most of Windows 10. WLED backlight."},{"feature":"6th Gen Intel&#174; Core&#8482; i3-6100U mobile processor\nSmart dual-core processing performance for HD-quality computing."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"128GB solid state drive (SSD)\nWhile offering less storage space than a hard drive, a flash-based SSD has no moving parts, resulting in faster start-up times and data access, no noise, and reduced heat production and power draw on the battery."},{"feature":"360&#176; flip-and-fold design\nOffers versatile functionality with laptop, audience, tabletop, presentation and tablet modes."},{"feature":"Intel&#174; HD Graphics\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Stream entertainment from your laptop to your TV\nIntel&#174; Wireless Display (c) wirelessly transmits content to your HDTV* &#8212; photos, music, Web videos, Internet TV &#8212; whether on the hard drive or online."},{"feature":"MaxxAudio\nTo give you great sound across music, movies, voice and games."},{"feature":"Weighs 3 lbs. and measures 0.7\" thin\nUltraportable design, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 3-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"3 USB 3.0 ports maximize the latest high-speed devices\nUSB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity (1x1, 433 Mbps)\nConnect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N (150 Mbps). Backward-compatible with all other Wi-Fi networks and hotspots."},{"feature":"Built-in HD webcam with two microphones\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard\nAllows you to enjoy comfortable and accurate typing, even in dim lighting."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Additional port\nHeadphone output."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"*Requires a separate wireless display adapter (not included), such as NETGEAR Push2TV, or a TV or receiver with built-in Intel WiDi."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.50,"customerReviewCount":592},{"name":"Dell - Inspiron 2-in-1 13.3\" Touch-Screen Laptop - Intel Core i7 - 12GB Memory - 256GB Solid State Drive - Gray","longDescription":"Only at Best Buy  Dell Inspiron Convertible 2-in-1 Laptop: Work or play on this 13-inch Dell Inspiron Starlord laptop. A backlit keyboard makes typing at night simple, and the convertible laptop transforms into a tablet. This Dell Inspiron Starlord laptop has an Intel Core processor to support versatile application use, and an HDMI port and two USB ports ensure convenient connection to peripherals.","salePrice":854.99,"percentSavings":"5.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"13.3\" Full HD touch screen for hands-on control\nThe 1920 x 1080 resolution boasts impressive color and clarity. Natural finger-touch navigation makes the most of Windows 10. IPS technology. WLED backlight."},{"feature":"7th Gen Intel&#174; Core&#8482; i7-7500U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"12GB system memory for full-power multitasking\nPlenty of high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"256GB solid state drive (SSD)\nWhile offering less storage space than a hard drive, a flash-based SSD has no moving parts, resulting in faster start-up times and data access, no noise, and reduced heat production and power draw on the battery."},{"feature":"360&#176; flip-and-fold design\nOffers versatile functionality with laptop, audience, tabletop, presentation and tablet modes."},{"feature":"Intel&#174; HD Graphics 620\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"MaxxAudio\nTo give you great sound across music, movies, voice and games."},{"feature":"Weighs 3.53 lbs. and measures 0.7\" thin\nUltraportable design, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 3-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. The USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity\nConnect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N. Backward-compatible with all other Wi-Fi networks and hotspots."},{"feature":"Built-in HD webcam with two microphones\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard\nAllows you to enjoy comfortable and accurate typing, even in dim lighting."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Additional port\nHeadphone/microphone combo jack."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.40,"customerReviewCount":560},{"name":"Dell - Inspiron 2-in-1 15.6\" Touch-Screen Laptop - Intel Core i7 - 12GB Memory - 512GB Solid State Drive - Gray","longDescription":"Only at Best Buy  Dell Inspiron Convertible 2-in-1 Laptop: Enjoy the convenience of a tablet or the functionality of a computer with this Dell Inspiron Starlord laptop. The 15-inch touch screen makes viewing the small details on websites simple, and the Intel Core processor keeps the computer running commands quickly. This Dell Inspiron Starlord laptop has a backlit keyboard so you can type in the dark.","salePrice":949.99,"percentSavings":"5.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" Full HD touch screen for hands-on control\nThe 1920 x 1080 resolution boasts impressive color and clarity. Natural finger-touch navigation makes the most of Windows 10. IPS technology. LED backlight."},{"feature":"7th Gen Intel&#174; Core&#8482; i7-7500U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"12GB system memory for full-power multitasking\nPlenty of high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"512GB solid state drive (SSD)\nWhile offering less storage space than a hard drive, a flash-based SSD has no moving parts, resulting in faster start-up times and data access, no noise, and reduced heat production and power draw on the battery."},{"feature":"360&#176; flip-and-fold design\nOffers versatile functionality with laptop, audience, tabletop, presentation and tablet modes."},{"feature":"Intel&#174; HD Graphics 620\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"MaxxAudio\nTo give you great sound across music, movies, voice and games."},{"feature":"Weighs 4.83 lbs. and measures 0.7\" thin\nUltraportable design, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 3-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. The USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity\nConnect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N. Backward-compatible with all other Wi-Fi networks and hotspots."},{"feature":"Built-in HD webcam with two microphones\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard\nAllows you to enjoy comfortable and accurate typing, even in dim lighting."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Additional port\nHeadphone/microphone combo jack."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.60,"customerReviewCount":693},{"name":"Dell - Inspiron 15.6\" Laptop - Intel Celeron - 4GB Memory - 500GB Hard Drive - Black","longDescription":"Take your work with you everywhere you go with this Dell Inspiron notebook in its ultra-slim case. The 15-inch screen with Intel HD graphics makes watching videos or playing games brilliantly clear. Store everything you need with the 500GB hard drive, and multitask without glitches with this Dell Inspiron notebook's 4GB of memory.","salePrice":299.99,"percentSavings":"4.76","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" display\nTypical 1366 x 768 HD resolution. Energy-efficient LED backlight."},{"feature":"Intel&#174; Celeron&#174; processor N3050\nEntry-level dual-core processor for general e-mail, Internet and productivity tasks."},{"feature":"4GB system memory for basic multitasking\nAdequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once."},{"feature":"500GB hard drive for serviceable file storage space\nHolds your growing collection of digital photos, music and videos. 5400 rpm spindle speed for standard read/write times."},{"feature":"Intel&#174; HD Graphics\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Built-in stereo speakers\nWaves MaxxAudio is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 4.72 lbs. and measures 0.9\" thin\nBalances portability and screen size, so you get a respectable amount of viewing space without the laptop being too cumbersome for practical portability. 4-cell lithium battery."},{"feature":"Bluetooth 4.0 interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the desktop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"1 USB 3.0 port maximizes the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 port is backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Wireless network connectivity\nHigh-speed wireless LAN built into the screen, so it connects to your network or hotspots on the most common Wi-Fi standards in both laptop and tablet modes."},{"feature":"Built-in HD webcam with microphone\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Basic software package included\nTrial, Multi-Language of Microsoft Office."},{"feature":"Additional ports\nHeadphone/microphone combo jack."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":3.30,"customerReviewCount":20},{"name":"Dell - Inspiron 2-in-1 15.6\" Touch-Screen Laptop - Intel Core i5 - 4GB Memory - 500GB Hard Drive - Gray","longDescription":"Dell Inspiron Convertible 2-in-1 Laptop: Get your hands on a versatile 15\" laptop packed with features for an enjoyable multimedia experience. Kick back and watch your favorite shows, or connect to your favorite sites and more with a spacious and crisp screen that offers room for multiple viewers to share at once. Crisp details and vibrant colors shine through as you access videos, photos and more.","salePrice":629.99,"percentSavings":"3.08","condition":"New","features":[{"feature":"15.6\" Full HD touch screen for hands-on control\nThe 1920 x 1080 resolution boasts impressive color and clarity. Energy-efficient LED backlight."},{"feature":"7th Gen Intel&#174; Core&#8482; i5-7200U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"4GB system memory for basic multitasking\nAdequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once."},{"feature":"500GB hard drive for serviceable file storage space\nHolds your growing collection of digital photos, music and videos."},{"feature":"360&#176; flip-and-fold design\nOffers versatile functionality with laptop, audience, tabletop, presentation and tablet modes."},{"feature":"Intel&#174; HD Graphics 620\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Weighs 4.59 lbs. and measures 0.8\" thin\nUltraportable design, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 3-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Dual-band wireless network connectivity\nBuilt-in high-speed wireless LAN built into the screen, so it connects to your network or hotspots on all current Wi-Fi standards in both laptop and tablet modes."},{"feature":"Additional port\nHeadphone/microphone combo jack."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - DG1TR Toner Cartridge - Yellow","longDescription":"This Dell DG1TR WM2JC yellow toner cartridge is compatible with select Dell color laser printers, so you can print out documents with bright, brilliant hues. The cartridge yields up to 1,400 pages for lasting use.","salePrice":67.99,"percentSavings":"2.86","condition":"New","features":[{"feature":"Yields up to 1,400 pages"},{"feature":"Compatible with select Dell color laser printers: 1250c, 1350cnw, 1355cn, 1355cnw, C1760nw and C1765nf"},{"feature":"Yellow toner helps you create vibrant prints"}],"customerReviewAverage":5,"customerReviewCount":3},{"name":"Dell - Inspiron 2-in-1 11.6\" Touch-Screen Laptop - Intel Pentium - 4GB Memory - 500GB Hard Drive - Tango red","longDescription":"Work or surf the Internet on this Dell Inspiron laptop computer, and enjoy the function of a tablet with the touchscreen display. Its small form makes it easy to slip into a bag for travel. Intel Pentium processing offers reliable speed, and this Dell Inspiron laptop computer is loaded with Windows 10 Home for dependable access.","salePrice":364.99,"percentSavings":"2.67","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"11.6\" touch screen for hands-on control\nTypical 1366 x 768 HD resolution. Natural finger-touch navigation makes the most of Windows 10. LED backlight."},{"feature":"Intel&#174; Pentium&#174; mobile processor N3710\nUltra-low-voltage platform. Quad-core processing with Burst Performance technology provides high-efficiency performance for everyday tasks."},{"feature":"4GB system memory for basic multitasking\nAdequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once."},{"feature":"360&#176; flip-and-fold design\nOffers versatile functionality with laptop, audience, tabletop, presentation and tablet modes."},{"feature":"Intel&#174; HD Graphics 405\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Weighs 3.06 lbs. and measures 0.8\" thin\nUltraportable design, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 2-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"1 USB 3.0 port maximizes the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 port is backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Wireless network connectivity\nHigh-speed wireless LAN built into the screen, so it connects to your network or hotspots on the most common Wi-Fi standards in both laptop and tablet modes."},{"feature":"Built-in HD webcam with two microphones\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Basic software package included\n30-days trial of Microsoft Office."},{"feature":"Additional port\nHeadphone/microphone combo jack."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":3.70,"customerReviewCount":26},{"name":"Dell - Latitude 12.5\" Laptop - Intel Core i7 - 8GB Memory - 256 Solid State Drive","longDescription":"Increase productivity with this Dell laptop. Its 2.6GHz Intel Core i7 processor provides smooth, speedy functioning, and its 8GB of RAM and 256GB hard drive hold important files and programs. High definition graphics provide crisp color images, while the Windows 7 Professional software on this 12.5-inch Dell laptop accommodates your work needs.","salePrice":1601.99,"percentSavings":"1.72","condition":"New","features":[{"feature":"Microsoft Windows 7 operating system preinstalled\nIt's your PC simplified, with fewer steps between you and what you do, easy sharing of photos and videos, and multiple ways to personalize your experience."},{"feature":"12.5\" display\nTypical 1366 x 768 HD resolution."},{"feature":"6th Gen Intel&#174; Core&#8482; i7-6600U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing provides maximum high-efficiency power to go. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"256GB solid state drive (SSD)\nWhile offering less storage space than a hard drive, a flash-based SSD has no moving parts, resulting in faster start-up times and data access, no noise, and reduced heat production and power draw on the battery."},{"feature":"Intel&#174; HD Graphics 520\nOn-processor graphics, designed to complement low-voltage processors and quickly render high-quality images and smoothly stream videos with frugal power consumption."},{"feature":"Weighs 2.77 lbs. and measures 0.7\" thin\nUltrathin and ultralight for maximum portability, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 4-cell lithium-polymer battery."},{"feature":"Bluetooth 4.1 interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"3 USB 3.0 ports for the latest high-speed devices\nUSB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-definition monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC, SDXC memory card formats."},{"feature":"Built-in HD webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues on Skype."},{"feature":"Additional ports\nMini DisplayPort. Microphone-in/headphone-out combo jack."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - Inspiron 2-in-1 15.6\" Touch-Screen Laptop - Intel Core i7 - 8GB Memory - 1TB Hard Drive - Gray","longDescription":"Dell Inspiron Convertible 2-in-1 Laptop: 15\" laptop with a glossy finish and HD display, so you can create a PC that reflects what matters to you.","salePrice":837.99,"percentSavings":"1.41","condition":"New","features":[{"feature":"15.6\" Full HD touch screen for hands-on control\nThe 1920 x 1080 resolution boasts impressive color and clarity. IPS technology for wide viewing angles. Energy-efficient LED backlight."},{"feature":"7th Gen Intel&#174; Core&#8482; i7-7500U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a sizeable collection of digital photos, music, HD videos and DVD-quality movies."},{"feature":"360&#176; flip-and-fold design\nOffers versatile functionality with laptop, audience, tabletop, presentation and tablet modes."},{"feature":"Intel&#174; HD Graphics 620\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Stream entertainment from your laptop to your TV\nIntel&#174; Wireless Display (c) wirelessly transmits content to your HDTV* &#8212; photos, music, Web videos, Internet TV &#8212; whether on the hard drive or online."},{"feature":"MaxxAudio\nTo give you great sound across music, movies, voice and games."},{"feature":"Weighs 4.61 lbs. and measures 0.8\" thin\nUltraportable design, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 3-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Dual-band wireless network connectivity\nBuilt-in high-speed wireless LAN built into the screen, so it connects to your network or hotspots on all current Wi-Fi standards in both laptop and tablet modes."},{"feature":"Additional port\nHeadphone/microphone combo jack."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"*Requires a separate wireless display adapter (not included), such as NETGEAR Push2TV, or a TV or receiver with built-in Intel WiDi."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.80,"customerReviewCount":4},{"name":"Dell - Latitude 14\" Refurbished Laptop - Intel Core i5 - 4GB Memory - 160GB Hard Drive - Black","longDescription":"Enjoy movies, photos and Web content in crisp detail with this Dell Latitude E6410-B4L laptop, which features a 14\" LCD with 1280 x 800 resolution for sharp images. Bluetooth technology enables simple wireless connection to compatible devices.    This product has been refurbished.  Learn more.","salePrice":269.99,"percentSavings":"0.0","condition":"Refurbished","features":[{"feature":"Microsoft Windows 7 operating system preinstalled\nIt's your PC simplified, with fewer steps between you and what you do, easy sharing of photos and videos, and multiple ways to personalize your experience."},{"feature":"Intel&#174; Core&#8482; i5 processor\nFeatures a 3MB cache and 2.4GHz processor speed."},{"feature":"Intel&#174; Core&#8482; i5 processor\nFeatures smart 4-way processing performance with a speed boost."},{"feature":"Intel&#174; Turbo Boost Technology\nDelivers extra performance when you need it and increased energy efficiency when you don't. Intel&#174; HD graphics provide extra graphics power for your laptop when you need it."},{"feature":"4GB DDR3 memory\nFor multitasking power, expandable to 8GB."},{"feature":"DVD drive\nLets you watch movies, listen to music and more."},{"feature":"14\" LCD\nWith 1280 x 800 resolution displays movies, games and other media in sharp detail."},{"feature":"160GB Serial ATA hard drive (5400 rpm)\nOffers spacious storage and fast read/write times."},{"feature":"Intel&#174; graphics\nFeature integrated video memory for lush images."},{"feature":"3 USB ports\nFor fast digital data transfer and easy peripheral connectivity."},{"feature":"Built-in high-speed wireless LAN (802.11b/g/n)\nConnect to the Internet without wires."},{"feature":"Bluetooth interface\nEasily link with other Bluetooth-enabled devices, such as a cell phone or MP3 player."},{"feature":"Built-in 10/100/1000 Ethernet LAN\nEnables quick and easy wired Web connection."},{"feature":"Weighs only 4.26 lbs. and measures just 1.4\" thin\nFor lightweight portability."},{"feature":"Magnesium-alloy construction\nAlong with a long-lasting painted finish and rugged metal hinges offers durability."},{"feature":"Software package included\nWith a 1-month trial of Microsoft Office 365."},{"feature":"Intel, Pentium, Celeron, Centrino, Core, Viiv, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":1,"customerReviewCount":1},{"name":"Dell - Latitude 14\" Refurbished Laptop - Intel Core i5 - 4GB Memory - 500GB Hard Drive - Black","longDescription":"Take your media collection on the go with this 14\" Dell Latitude E6410-4GB-500GB laptop, which features a 500GB hard drive that offers plenty of space to house pictures, videos and more. A Bluetooth interface allows wireless pairing with select devices.    This product has been refurbished.  Learn more.","salePrice":226.99,"percentSavings":"0.0","condition":"Refurbished","features":[{"feature":"Microsoft Windows 7 operating system preinstalled\nIt's your PC simplified, with fewer steps between you and what you do, easy sharing of photos and videos, and multiple ways to personalize your experience."},{"feature":"Intel&#174; Core&#8482; i5 processor\nFeatures a 3MB cache and 2.4GHz processor speed."},{"feature":"Intel&#174; Core&#8482; i5 processor\nFeatures smart 4-way processing performance with a speed boost."},{"feature":"Intel&#174; Turbo Boost Technology\nDelivers extra performance when you need it and increased energy efficiency when you don't."},{"feature":"4GB DDR3 memory\nFor multitasking power, expandable to 8GB."},{"feature":"DVD/CD drive\nAllows you to enjoy your favorite media."},{"feature":"14\" display\nWith 1280 x 800 resolution presents media in rich detail."},{"feature":"500GB Serial ATA hard drive (5400 rpm)\nOffers spacious storage and fast read/write times."},{"feature":"Intel&#174; graphics\nDeliver realistic visuals. DisplayPort and VGA interfaces enable flexible connectivity."},{"feature":"3 USB ports\nFor fast digital video, audio and data transfer."},{"feature":"Built-in high-speed wireless LAN (802.11b/g/n)\nAllows you to connect to the Internet without wires."},{"feature":"Bluetooth interface\nEasily link with other Bluetooth-enabled devices, such as a cell phone or MP3 player."},{"feature":"Built-in 10/100/1000 Ethernet LAN\nEnables quick and simple wired Web access."},{"feature":"Weighs 4.26 lbs. and measures just 1.4\" thin\nFor lightweight portability."},{"feature":"Magnesium alloy construction with metal hinges\nCreates a durable design."},{"feature":"Software package included\nWith 1-month trial of Microsoft Office 365."},{"feature":"Intel, Pentium, Celeron, Centrino, Core, Viiv, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":2,"customerReviewCount":4},{"name":"Dell - Latitude 14\" Refurbished Laptop - Intel Core 2 Duo - 2GB Memory - 160GB Hard Drive - Black","longDescription":"This 14\" Dell Latitude E6400-B4L laptop's Bluetooth interface allows you to wirelessly pair with select devices. Intel&#174; Core&#8482;2 Duo processor provides advanced dual-core multitasking with breakthrough power efficiency.    This product has been refurbished.  Learn more.","salePrice":194.99,"percentSavings":"0.0","condition":"Refurbished","features":[{"feature":"Microsoft Windows 7 operating system preinstalled\nIt's your PC simplified, with fewer steps between you and what you do, easy sharing of photos and videos, and multiple ways to personalize your experience."},{"feature":"Intel&#174; Core&#8482;2 Duo processor\nFeatures a 2MB cache and 2.2GHz processor speed."},{"feature":"The Intel&#174; Core&#8482;2 Duo processor\nFeatures great 2-way processing performance for your mobile needs."},{"feature":"2GB DDR2 memory\nFor multitasking power, expandable to 6GB."},{"feature":"DVD/CD drive\nAllows you to enjoy your favorite media."},{"feature":"14\" display\nWith 1280 x 800 resolution presents media in rich detail."},{"feature":"160GB Serial ATA hard drive (5400 rpm)\nOffers spacious storage and fast read/write times."},{"feature":"Intel&#174; graphics\nDeliver realistic visuals. DisplayPort and VGA interfaces enable flexible connectivity."},{"feature":"4 USB ports\nFor fast digital video, audio and data transfer."},{"feature":"Built-in high-speed wireless LAN (802.11a)\nAllows you to connect to the Internet without wires."},{"feature":"Bluetooth interface\nEasily link with other Bluetooth-enabled devices, such as a cell phone or MP3 player."},{"feature":"Built-in 10/100/1000 Ethernet LAN\nEnables quick and simple wired Web access."},{"feature":"Weighs 4.3 lbs. and measures just 1.3\" thin\nFor lightweight portability."},{"feature":"Magnesium alloy construction with metal hinges\nCreates a durable design."},{"feature":"Software package included\nWith 1-month trial of Microsoft Office 365."},{"feature":"Intel, Pentium, Celeron, Centrino, Core, Viiv, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":1.50,"customerReviewCount":2},{"name":"Dell - Tablet Keyboard - Slim","longDescription":"Super-slim keyboard for effortless, laptop-style typing The Dell Tablet Keyboard - Slim is ultra-thin and lightweight with full-sized keys that make typing easy and natural. The built-in touch pad offers high-precision gesture control without the need for a separate mouse. There is also a convenient built-in holder for your stylus. Convenient viewing angle This slim, lightweight keyboard with dock is sturdy enough to hold your tablet firmly in place while you type, browse, or watch videos. The built-in hinge provides a fixed 117-degree viewing angle and secures your tablet in place with magnets.Protects screen when not in use When not in use, the keyboard folds over your tablet to protect the screen from scratches and dings. Compatibility information The Dell Tablet Keyboard - Slim is compatible with the Dell Venue 11 Pro and is Windows 8 compliant.","salePrice":129.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Keyboard/Keypad Connectivity Technology: Docking"},{"feature":"Pointing Device Type: TouchPad"},{"feature":"Keyboard/Keypad Host Interface: Docking Port"},{"feature":"Keyboard/Keypad Height: 0.10\""},{"feature":"Weight (Approximate): 11 oz"},{"feature":"Device Supported: Tablet"},{"feature":"Limited Warranty: 1 Year"}],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - Inspiron 23.8\" Touch-Screen All-In-One - AMD A8-Series - 8GB Memory - 1TB Hard Drive - Black/White","longDescription":"Dell Inspiron All-In-One Computer: Glide your fingertips across the 23.8\" touch screen to adjust music and video playback, surf the Web and play games, all in 1920 x 1080 resolution. Built-in Wi-Fi provides easy access to streaming entertainment.","salePrice":629.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Microsoft Windows 10 operating system\nWindows 10 brings back the popular Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"All-in-one design saves space and cuts clutter\nA full computer is housed inside the monitor, so you get all the power of a PC in a streamlined design that involves fewer cables and takes up less space on a desk, table or kitchen counter."},{"feature":"23.8\" Full HD touch screen\nTouch capability puts control at your fingertips. 1920 x 1080 resolution boasts impressive color and clarity. TrueLife technology enhances picture quality, and IPS technology offers wide viewing angles. LED backlight."},{"feature":"AMD A8-7410 accelerated processor\nQuad-core processing. AMD Quad-Core A8 APU handles the AMD Radeon graphics alongside the central processor to balance the load, enabling great performance, immersive graphics and a host of intelligent features."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"DVD/CD burner\nReads and writes to a variety of media formats."},{"feature":"1TB hard drive for ample file storage space\nHolds a significant collection of digital photos, music, HD videos and DVD-quality movies. 5400 rpm spindle speed for standard read/write times."},{"feature":"Built-in HD webcam with dual microphones\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Built-in media reader for simple photo transfer\nSupports select memory card formats."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Wireless and wired network connectivity\nBuilt-in high-speed wireless LAN connects to your network on the most common Wi-Fi standards. Ethernet LAN port plugs into wired networks."},{"feature":"Bluetooth 4.0 interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the computer and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"Wireless keyboard and wireless mouse reduce cable clutter\nType in a comfortable location and keep your workspace neat and orderly."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Built-in stereo speakers\nWaves MaxxAudio creates lush, detailed sound."},{"feature":"Additional ports\nAudio line-out. HDMI output. Microphone in/headphone out combo jack."},{"feature":"AMD, AMD Arrow logo and combinations thereof are trademarks of Advanced Micro Devices, Inc."},{"feature":"**Offer valid for qualified Windows devices for one year after Windows 10 upgrade availability. Windows 10 features vary by device. See www.windows.com/windows10specs for details"}],"customerReviewAverage":4.30,"customerReviewCount":1925},{"name":"Dell - Tablet Pro 11i 10.8\" - 128GB - Black","longDescription":"Learn more about the New Windows Enjoy apps, movies and Web content in arresting clarity with this Dell Tablet Pro 11i PRO11I6363BLK tablet, which features a 10.8\" touch screen that displays images in 1920 x 1080 resolution. The 128GB solid state drive offers ample storage space.","salePrice":699.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"10.8\" high-definition touch-screen display with 1920 x 1080 resolution\nSimplifies navigation of features and showcases media in brilliant clarity."},{"feature":"Windows 8.1 32-bit\nAllows you to stay productive and connected on the go."},{"feature":"128GB storage capacity\nFor housing your favorite media."},{"feature":"Dual-core processor\n4th Gen Intel&#174; Core&#8482; i3-4020Y processor with a 3MB cache and 1.5GHz processor speed for optimal performance."},{"feature":"Dell Wireless 1537 dual-band 2x2 Wi-Fi (802.11n)\nProvides fast Web connection for downloading apps, streaming content and staying connected with social media."},{"feature":"Bluetooth 4.0 interface\nEnables simple wireless pairing with compatible devices."},{"feature":"8.0MP rear-facing and 2.0MP front-facing webcams\nCapture clear images and, along with dual microphones with adaptive noise cancellation, make it easy to video chat with friends and family."},{"feature":"microSD slot\nAllows storage expansion with a compatible card (not included)."},{"feature":"Intel&#174; GT2 graphics\nFor lush, detailed images."},{"feature":"SRS Premium Audio\nAlong with built-in stereo speakers produces crisp sound. Headphone jack allows private listening."},{"feature":"Mini HDMI output\nEnables simple connection to an HDTV or other high-definition display."},{"feature":"USB 3.0 port\nFor easy connectivity."},{"feature":"Software package\nIncludes a trial version of Microsoft Office."}],"customerReviewAverage":4,"customerReviewCount":1},{"name":"Dell - Graphic Adapter for Select Dell Systems - Black","longDescription":"Connect your laptop to an external display with this Dell 470ABHH graphic adapter, which features a USB 3.0 connection and HDMI, VGA, Ethernet and USB 2.0 ports to fit a variety of displays and peripherals .","salePrice":51.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Compatible with select Dell systems\nIncluding Inspiron 3451, Inspiron 7348, Latitude 7350, Precision M3800, Venue 10 (5050), Venue 10 Pro (5055), Venue 11 Pro (7140) and XPS 13 (9343) for wide-ranging use."},{"feature":"Graphic adapter\nLets you connect your laptop to an external display."},{"feature":"USB 3.0 to HDMI/VGA/Ethernet/USB 2.0 connection\nAllows use with a monitor, an Ethernet connection and other peripherals simultaneously."}],"customerReviewAverage":4.80,"customerReviewCount":6},{"name":"Dell - Inspiron 2-in-1 11.6\" Touch-Screen Laptop - Intel Core i3 - 4GB Memory - 500GB Hard Drive - Silver","longDescription":"Dell Inspiron Convertible 2-in-1 Laptop: With its 11.6\" touch screen, this laptop makes it easy to browse the Web and swipe through features wherever you go. You can also convert from a laptop to a tablet using the 360&#176; hinge.","salePrice":549.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Microsoft Windows 10 operating system\nWindows 10 brings back the popular Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"11.6\" edge-to-edge touch screen\nTap, scroll and zoom through features. Typical 1366 x 768 HD resolution. LED backlight."},{"feature":"4th Gen Intel&#174; Core&#8482; i3-4030U processor\nSmart dual-core, four-way processing performance for HD-quality computing."},{"feature":"4GB system memory for basic multitasking\nAdequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once."},{"feature":"500GB hard drive for serviceable file storage space\nHolds your growing collection of digital photos, music and videos. 5400 rpm spindle speed for standard read/write times."},{"feature":"360&#176; hinge\nLets you quickly switch between laptop and tablet modes."},{"feature":"Intel&#174; HD Graphics 4400\nFourth-generation on-processor graphics, designed to complement low-voltage processors and render high-quality images and stream videos with reduced power consumption."},{"feature":"Integrated stereo speakers\nWaves MaxxAudio offers crisp, clear sound."},{"feature":"Weighs 3.07 lbs. and measures 3.03\" thin\nUltraportable design, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 3-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. The USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD and MMC memory card formats."},{"feature":"Wireless network connectivity\nBuilt-in high-speed wireless LAN connects to your network or hotspots on the most common Wi-Fi standards."},{"feature":"Built-in webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Basic software package included\n30-day trial of Microsoft Office."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."},{"feature":"**Offer valid for qualified Windows devices for one year after Windows 10 upgrade availability. Windows 10 features vary by device. See www.windows.com/windows10specs for details"}],"customerReviewAverage":4.30,"customerReviewCount":3},{"name":"Dell - Inspiron 15.6\" Touch-Screen Laptop - Intel Core i5 - 12GB Memory - 1TB Hard Drive - Silver","longDescription":"Dell Inspiron Laptop: Stay productive and entertained wherever you go with this efficient laptop, which features a generous 1TB hard drive that offers room for important documents and your growing music and movie collection. Easily browse the Web and swipe through features using the 15.6\" touch screen.","salePrice":749.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Microsoft Windows 10 operating system\nWindows 10 brings back the popular Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" touch screen\nTouch, tap and glide through features. 1920 x 1080 resolution boasts impressive color and clarity. True Color technology. LED backlight."},{"feature":"5th Gen Intel&#174; Core&#8482; i5-5200U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing provides maximum high-efficiency power to go. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"12GB system memory for full-power multitasking\nPlenty of high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a significant collection of digital photos, music, HD videos and DVD-quality movies. 5400 rpm spindle speed for standard read/write times."},{"feature":"Intel&#174; HD Graphics\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Integrated stereo speakers\nMaxxAudio creates rich, detailed sound."},{"feature":"Weighs 5.11 lbs.\nBalances portability and screen size, so you get a respectable amount of viewing space without the laptop being too cumbersome for practical portability. 4-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"1 USB 3.0 port maximizes the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 port is backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Wireless and wired network connectivity\nBuilt-in high-speed wireless LAN connects to your network or hotspots on the most common Wi-Fi standards. The Fast Ethernet LAN port also lets you plug into wired networks."},{"feature":"Built-in webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard for easy typing in dim or dark locations\nA 10-digit numeric keypad allows precise data entry."},{"feature":"Tray-load DVD writer\nWatch your favorite movies and create custom discs."},{"feature":"Basic software package included\n30-day trial of Microsoft Office."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."},{"feature":"**Offer valid for qualified Windows devices for one year after Windows 10 upgrade availability. Windows 10 features vary by device. See www.windows.com/windows10specs for details"}],"customerReviewAverage":4.50,"customerReviewCount":6},{"name":"Dell - Inspiron 23.8\" Touch-Screen All-In-One - AMD A6-Series - 4GB Memory - 1TB Hard Drive - White","longDescription":"Provide versatile entertainment for the whole family with this Dell Inspiron all-in-one desktop. Its Windows 10 Home operating system runs efficiently with a quad-core AMD A6 processor and 4GB of RAM, and it has a large storage capacity of 1TB. This Dell Inspiron all-in-one desktop lets you perform tasks intuitively with its 23.8-inch Full HD touch-screen monitor.","salePrice":699.99,"percentSavings":"0.0","condition":"New","features":[],"customerReviewAverage":null,"customerReviewCount":null},{"name":"Dell - Inspiron 15.6\" Laptop - Intel Core i5 - 8GB Memory - 1TB Hard Drive - Glossy White","longDescription":"Dell Inspiron Laptop: This laptop's HD display with TrueLife and True Color technologies offers bright, natural color and crisp detail for everyday Web browsing, photo editing and more. The 1TB hard drive provides ample space for photos and music, and MaxxAudio speakers deliver rich sound for your favorite entertainment.","salePrice":640.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" display\nTrue Color screen lets you adjust the color saturation for optimal viewing. Typical 1366 x 768 HD resolution. Energy-efficient LED backlight."},{"feature":"5th Gen Intel&#174; Core&#8482; i5-5200U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing provides maximum high-efficiency power to go. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a significant collection of digital photos, music, HD videos and DVD-quality movies. 5400 rpm spindle speed for standard read/write times."},{"feature":"Intel&#174; HD Graphics\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Built-in stereo speakers\nWaves MaxxAudio is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 4.41 lbs. and measures 0.9\" thin\nBalances portability and screen size, so you get a respectable amount of viewing space without the laptop being too cumbersome for practical portability. 4-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"1 USB 3.0 port maximizes the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 port is backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Next-generation wireless connectivity\nConnects to your network or hotspots on all current Wi-Fi standards. Connect to a Wireless-AC router for speed nearly 3x faster than Wireless-N. The Ethernet LAN port also plugs into wired networks."},{"feature":"Built-in webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard for easy typing in dim or dark locations\nBuilt-in 10-key numeric keypad to quickly input numbers. Precision touchpad lets you zoom, point and scroll easily."},{"feature":"DVD/CD burner\nReads and writes to a variety of media formats, including DVD+R/RW, DVD-R/RW and CD-R/RW."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.20,"customerReviewCount":5},{"name":"Dell - S2716DG G-SYNC 27\" LED Monitor - Piano Black","longDescription":"With an ultrafast 1 ms response time in fast mode, this Dell S2716DG LED monitor provides crisp motion quality for videos and gaming. The 27\" screen makes multitasking easy and offers vivid image clarity.","salePrice":799.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"1 ms response time in fast mode, 3 ms response time in normal mode\nLets you play games and watch TV or movies with minimized streaking and blurring. NVIDIA G-SYNC and a 144Hz refresh rate help ensure sharp, undistorted moving images."},{"feature":"27\" LED screen\nOffers crisp, vivid image clarity. Tilt, swivel, pivot and height adjustment features let you find a comfortable gaming position."},{"feature":"1000:1 typical contrast ratio\nDelivers bright whites and deep blacks."},{"feature":"350 cd/m&#178; brightness\nEnables easy viewing in a variety of lighting situations."},{"feature":"2560 x 1440 maximum resolution\nProvides detailed, precise image quality."}],"customerReviewAverage":4.30,"customerReviewCount":4},{"name":"Dell - Inspiron 15.6\" Laptop - Intel Celeron - 4GB Memory - 500GB Hard Drive - Black","longDescription":"Dell Inspiron Laptop: Whether you're finishing up a work assignment or relaxing and watching a movie, this laptop's TrueLife HD display offers crisp detail for clear visibility. Bluetooth and USB ports offer flexible connectivity, and built-in wireless networking provides fast Web access.","salePrice":349.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" display\nTrueLife technology showcases photos and videos in vivid color and detail. Typical 1366 x 768 HD resolution. Energy-efficient LED backlight."},{"feature":"Intel&#174; Celeron&#174; processor N3050\nEntry-level dual-core processor for general e-mail, Internet and productivity tasks."},{"feature":"4GB system memory for basic multitasking\nAdequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once."},{"feature":"500GB hard drive for serviceable file storage space\nHolds your growing collection of digital photos, music and videos. 5400 rpm spindle speed for standard read/write times."},{"feature":"Intel&#174; HD Graphics\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Built-in stereo speakers\nWaves MaxxAudio is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 5.11 lbs. and measures 0.9\" thin\nBalances portability and screen size, so you get a respectable amount of viewing space without the laptop being too cumbersome for practical portability. 4-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"1 USB 3.0 port maximizes the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 port is backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Next-generation wireless connectivity\nConnects to your network or hotspots on all current Wi-Fi standards. Connect to a Wireless-AC router for speed nearly 3x faster than Wireless-N. The Fast Ethernet LAN port also plugs into wired networks."},{"feature":"Built-in HD webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Full keyboard with 10-key numeric keypad\nType comfortably, input numbers quickly and maneuver through games with ease. Precision touchpad with multitouch control."},{"feature":"DVD/CD burner\nReads and writes to a variety of media formats, including DVD+R/RW, DVD-R/RW and CD-R/RW."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":2.30,"customerReviewCount":3},{"name":"Dell - XPS 15.6\" 4K Ultra HD Touch-Screen Laptop - Intel Core i7 - 16GB Memory - 512GB Solid State Drive - Silver","longDescription":"Dell XPS 4K Ultra HD Laptop: With a vivid 4K Ultra HD touch-screen display and 2GB dedicated graphics, this laptop provides impressive image quality and smooth processing for gaming, video- and photo-editing, or watching movies. The 512GB solid state drive enables fast start-up times, and the backlit keyboard lets you type in dim lighting.","salePrice":1799.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" InfinityEdge 4K Ultra HD touch screen for hands-on control\nTouch, tap, glide and make the most of Windows 10. UltraSharp 4K Ultra HD (3840 x 2160) resolution delivers stunning color and clarity with nearly 4x the pixel density of Full HD."},{"feature":"6th Gen Intel&#174; Core&#8482; i7-6700HQ processor\nPowerful quad-core, eight-way processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it, while increasing energy efficiency when you don't."},{"feature":"16GB system memory for intense multitasking and gaming\nReams of high-bandwidth DDR3 RAM to smoothly run your graphics-heavy PC games and video-editing applications, as well as numerous programs and browser tabs all at once."},{"feature":"512GB solid state drive (SSD)\nWhile offering less storage space than a hard drive, a flash-based SSD has no moving parts, resulting in faster start-up times and data access, no noise, and reduced heat production and power draw on the battery."},{"feature":"NVIDIA GeForce GTX 960M graphics\nDriven by 2GB dedicated video memory to quickly render high-quality images for videos and games."},{"feature":"Built-in stereo speakers\nWaves MaxxAudio Pro is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 4.4 lbs. and measures 0.66\" thin\nThin and light design with DVD/CD drive omitted for improved portability. 6-cell lithium-ion battery."},{"feature":"Voice assistant capability\nSoftware preinstalled so you can type by talking and control the laptop through voice commands."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nUSB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Next-generation wireless connectivity\nConnects to your network or hotspots on all current Wi-Fi standards. Connect to a Wireless-AC router for speed nearly 3x faster than Wireless-N. The Fast Ethernet LAN port also plugs into wired networks."},{"feature":"Built-in HD webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard for easy typing in dim or dark locations\nTouchpad for simple navigation."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.60,"customerReviewCount":17},{"name":"Dell - Inspiron 15.6\" Touch-Screen Laptop - AMD A8-Series - 8GB Memory - 1TB Hard Drive - Gloss Black","longDescription":"Dell Inspiron Touch-Screen Laptop: Stay connected and productive at home or on the go with this laptop, which features built-in wireless networking for fast Web access and Bluetooth for simple wireless pairing. The touch screen enables simple navigation of Web pages and programs, and the webcam lets you chat with friends and family.","salePrice":469.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" touch screen for hands-on control\nTouch, tap, glide and make the most of Windows 10. TrueLife technology provides vivid color and clarity for your photos and videos. Typical 1366 x 768 HD resolution. Energy-efficient LED backlight."},{"feature":"AMD A8-7410 accelerated processor\nQuad-core processing. AMD Quad-Core A8 APU handles the AMD Radeon graphics alongside the central processor to balance the load, enabling great performance, immersive graphics and a host of intelligent features."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a significant collection of digital photos, music, HD videos and DVD-quality movies. 5400 rpm spindle speed for standard read/write times."},{"feature":"AMD Radeon graphics\nIntegrated graphics chipset with shared video memory provides solid image quality for Internet use, movies, basic photo editing and casual gaming."},{"feature":"Built-in stereo speakers\nWaves MaxxAudio is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 5.47 lbs. and measures 0.9\" thin\nBalances portability and screen size, so you get a respectable amount of viewing space without the laptop being too cumbersome for practical portability. 4-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"1 USB 3.0 port maximizes the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 port is backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Wireless and wired network connectivity\nBuilt-in high-speed wireless LAN connects to your network or hotspots on the most common Wi-Fi standards. The Fast Ethernet LAN port also lets you plug into wired networks."},{"feature":"Built-in HD webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Full keyboard with 10-key numeric keypad\nType comfortably, input numbers quickly and maneuver through games with ease. Precision touchpad with multitouch control."},{"feature":"DVD/CD burner\nReads and writes to a variety of media formats, including DVD+R/RW, DVD-R/RW and CD-R/RW."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"AMD, AMD Arrow logo and combinations thereof are trademarks of Advanced Micro Devices, Inc."}],"customerReviewAverage":3.90,"customerReviewCount":22},{"name":"Dell - Inspiron 15.6\" Laptop - Intel Pentium - 4GB Memory - 500GB Hard Drive - Black","longDescription":"Dell Inspiron Laptop: Keep in touch with friends and family using this laptop, which features built-in wireless networking for fast Web access and a built-in webcam for simple video chatting. Connect to accessories and peripherals using the USB ports, HDMI output and Bluetooth interface.","salePrice":329.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" display\nTrueLife technology offers bright, natural color and detail for your photos and videos. Typical 1366 x 768 HD resolution. Energy-efficient LED backlight."},{"feature":"Intel&#174; Pentium&#174; mobile processor N3700\nUltra-low-voltage platform. Quad-core processing provides high-efficiency performance for everyday tasks."},{"feature":"4GB system memory for basic multitasking\nAdequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once."},{"feature":"500GB hard drive for serviceable file storage space\nHolds your growing collection of digital photos, music and videos. 5400 rpm spindle speed for standard read/write times."},{"feature":"Intel&#174; HD Graphics\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Built-in stereo speakers\nWaves MaxxAudio is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 4.72 lbs. and measures 0.9\" thin\nThin and light design with DVD/CD drive omitted for improved portability. 4-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"1 USB 3.0 port maximizes the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 port is backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Wireless and wired network connectivity\nBuilt-in high-speed wireless LAN connects to your network or hotspots on the most common Wi-Fi standards. The Fast Ethernet LAN port also lets you plug into wired networks."},{"feature":"Built-in HD webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Full keyboard with 10-key numeric keypad\nType comfortably, input numbers quickly and maneuver through games with ease. Touchpad with multitouch control."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4,"customerReviewCount":1},{"name":"Dell - Inspiron 15.6\" Laptop - Intel Celeron - 4GB Memory - 500GB Hard Drive - Black","longDescription":"Dell Inspiron Laptop: With an HD webcam, HDMI output and built-in wireless networking, this laptop makes it easy to stay connected at home or on the go. Connect to a variety of accessories and peripherals using the Bluetooth interface or USB ports, and store plenty of photos and videos on the 500GB hard drive.","salePrice":299.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" display\nTrueLife technology offers bright colors and crisp detail for your photos and videos. Typical 1366 x 768 HD resolution. Energy-efficient LED backlight."},{"feature":"Intel&#174; Celeron&#174; processor N3050\nEntry-level dual-core processor for general e-mail, Internet and productivity tasks."},{"feature":"4GB system memory for basic multitasking\nAdequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once."},{"feature":"500GB hard drive for serviceable file storage space\nHolds your growing collection of digital photos, music and videos. 5400 rpm spindle speed for standard read/write times."},{"feature":"Intel&#174; HD Graphics\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Built-in stereo speakers\nWaves MaxxAudio is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 4.72 lbs. and measures 0.9\" thin\nThin and light design with DVD/CD drive omitted for improved portability. 4-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"1 USB 3.0 port maximizes the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 port is backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Wireless and wired network connectivity\nBuilt-in high-speed wireless LAN connects to your network or hotspots on the most common Wi-Fi standards. The Fast Ethernet LAN port also lets you plug into wired networks."},{"feature":"Built-in HD webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Full keyboard with 10-key numeric keypad\nType comfortably, input numbers quickly and maneuver through games with ease. Touchpad with multitouch control."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":3.60,"customerReviewCount":5},{"name":"Dell - Inspiron 2-in-1 11.6\" Touch-Screen Laptop - Intel Pentium - 4GB Memory - 128GB Solid State Drive - Red","longDescription":"Dell Inspiron Convertible 2-in-1 Laptop: With 4 versatile modes, this touch-screen laptop lets you play games, watch movies and type up notes with ease. Use the 360&#176; hinge to transition between laptop and tablet modes, and connect to accessories and speakers using the Bluetooth interface.","salePrice":449.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"11.6\" touch screen for hands-on control\nTouch, tap, glide and make the most of Windows 10. Typical 1366 x 768 HD resolution. Energy-efficient LED backlight."},{"feature":"Intel&#174; Pentium&#174; mobile processor N3700\nUltra-low-voltage platform. Quad-core processing with Burst Performance technology provides high-efficiency performance for everyday tasks."},{"feature":"4GB system memory for basic multitasking\nAdequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once."},{"feature":"128GB solid state drive (SSD)\nWhile offering less storage space than a hard drive, a flash-based SSD has no moving parts, resulting in faster start-up times and data access, no noise, and reduced heat production and power draw on the battery."},{"feature":"360&#176; hinge\nTransition between 4 versatile viewing modes &#8212; laptop, tablet, tent and stand."},{"feature":"Intel&#174; HD Graphics\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Built-in stereo speakers\nWaves MaxxAudio is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 3.07 lbs. and measures 0.8\" thin\nUltrathin and ultralight for maximum portability, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 3-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nAlso includes 1 USB 2.0 port to connect more accessories and peripherals. The USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD and MMC memory card formats."},{"feature":"Wireless and wired network connectivity\nBuilt-in high-speed wireless LAN connects to your network or hotspots on the most common Wi-Fi standards. The Ethernet LAN port also lets you plug into wired networks."},{"feature":"Built-in HD webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.50,"customerReviewCount":13},{"name":"Dell - Inspiron 17.3\" Laptop - Intel Core i5 - 8GB Memory - 1TB Hard Drive - Black Gloss","longDescription":"Dell Inspiron Laptop: This laptop's expansive 17.3\" display features vivid HD+ resolution, so you can enjoy videos and movies in crisp clarity. Connect accessories using the USB ports or Bluetooth interface, and type comfortably using the full backlit keyboard.","salePrice":699.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"17.3\" HD+ display\n1600 x 900 resolution showcases your games and HD movies with crisp color and clarity. Energy-efficient LED backlight."},{"feature":"6th Gen Intel&#174; Core&#8482; i5-6200U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing provides maximum high-efficiency power to go. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a significant collection of digital photos, music, HD videos and DVD-quality movies. 5400 rpm spindle speed for standard read/write times."},{"feature":"Intel&#174; HD Graphics 520\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Built-in stereo speakers\nWaves MaxxAudio is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 6.24 lbs. and measures 0.8\" thin\nPrioritizes screen size without sacrificing portability, so you get lots of viewing space without the laptop being too hefty to move around. 4-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"1 USB 3.0 port maximizes the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 port is backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity (1x1, 433 Mbps)\nConnect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N (150 Mbps). Backward-compatible with all other Wi-Fi networks and hotspots."},{"feature":"Built-in HD webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard for easy typing in dim or dark locations\nBuilt-in 10-key numeric keypad to quickly input numbers. Touchpad for precise navigation."},{"feature":"DVD/CD burner\nReads and writes to a variety of media formats, including DVD+R/RW, DVD-R/RW and CD-R/RW."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.50,"customerReviewCount":26},{"name":"Dell - Inspiron 17.3\" Touch-Screen Laptop - Intel Core i5 - 8GB Memory - 1TB Hard Drive - Matte Silver","longDescription":"Dell Inspiron Touch-Screen Laptop: This laptop's 17.3\" HD touch-screen display offers an expansive workspace for editing photos, managing spreadsheets and browsing the Web. The backlit keyboard features a numeric keypad and a precision touchpad for simple navigation and easy number input, so you can stay productive on the go.","salePrice":799.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"15.6\" Full HD TrueLife touch screen for hands-on control\nNatural finger-touch navigation makes the most of Windows 10. The 1920 x 1080 resolution boasts impressive color and clarity. Energy-efficient LED backlight."},{"feature":"6th Gen Intel&#174; Core&#8482; i5-6200U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing provides maximum high-efficiency power to go. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a significant collection of digital photos, music, HD videos and DVD-quality movies. 5400 rpm spindle speed for standard read/write times."},{"feature":"Intel&#174; HD Graphics 520\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Built-in stereo speakers\nWaves MaxxAudio is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 6.24 lbs. and measures 0.8\" thin\nPrioritizes screen size without sacrificing portability, so you get lots of viewing space without the laptop being too hefty to move around. 4-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"1 USB 3.0 port maximizes the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 port is backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity (1x1, 433 Mbps)\nConnect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N (150 Mbps). Backward-compatible with all other Wi-Fi networks and hotspots."},{"feature":"Built-in HD webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Backlit keyboard for easy typing in dim or dark locations\nBuilt-in 10-key numeric keypad to quickly input numbers. Large touchpad for precise navigation."},{"feature":"DVD/CD burner\nReads and writes to a variety of media formats, including DVD+R/RW, DVD-R/RW and CD-R/RW."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":3.50,"customerReviewCount":11},{"name":"Dell - Inspiron 15.6\" Touch-Screen Laptop - Intel Core i5 - 12GB - 1TB Hard Drive - Matte silver","longDescription":"This Dell Inspiron 15.6-inch Real Sense laptop has an Intel Core i5-6200U processor for fast Web browsing and gaming. The 1TB hard drive lets you store memories and music without slowing down performance. Utilize up to seven hours of battery life while you're on the go with the Dell Inspiron 15.6-inch Real Sense laptop.","salePrice":783.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"15.6\" Full HD touch screen for hands-on control\nThe 1920 x 1080 resolution boasts impressive color and clarity. Natural finger-touch navigation makes the most of Windows 10. Energy-efficient LED backlight."},{"feature":"6th Gen Intel&#174; Core&#8482; i5-6200U mobile processor\nUltra-low-voltage platform. Dual-core processing performance. Intel Turbo Boost Technology delivers dynamic extra power when you need it, while increasing energy efficiency when you don't."},{"feature":"12GB system memory for full-power multitasking\nPlenty of high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a sizeable collection of digital photos, music, HD videos and DVD-quality movies. 5400 rpm spindle speed for standard read/write times."},{"feature":"Intel&#174; HD Graphics 520\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Built-in stereo speakers\nWaves MaxxAudio is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 5.07 lbs. and measures 0.9\" thin \nBalances portability and screen size, so you get a respectable amount of viewing space without the laptop being too cumbersome for practical portability. 4-cell lithium ion battery."},{"feature":"Bluetooth 4.0 interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the desktop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"1 USB 3.0 port maximize the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 port is backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Wireless network connectivity\nHigh-speed wireless LAN built into the screen, so it connects to your network or hotspots on the most common Wi-Fi standards in both laptop and tablet modes."},{"feature":"Built-in HD webcam with two microphones\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"Additional ports\nHeadphone/microphone combo jack"},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":4.90,"customerReviewCount":14},{"name":"Dell - Inspiron 17.3\" Laptop - AMD A8-Series - 8GB Memory - 1TB Hard Drive - Black","longDescription":"Dell Inspiron Laptop: This laptop's expansive 17.3\" screen is ideal for editing photos, watching movies and playing games. Connect to accessories using the Bluetooth interface or USB ports, and easily stream videos and browse the Web using built-in Wi-Fi.","salePrice":599.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"17.3\" TrueLife display\nTrueColor technology lets you adjust color saturation for optimal viewing. Vivid 1600 x 900 HD+ resolution. Energy-efficient LED backlight."},{"feature":"AMD A8-7410 accelerated processor\nQuad-core processing. AMD Quad-Core A8 APU handles the AMD Radeon graphics alongside the central processor to balance the load, enabling great performance, immersive graphics and a host of intelligent features."},{"feature":"8GB system memory for advanced multitasking\nSubstantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a significant collection of digital photos, music, HD videos and DVD-quality movies. 5400 rpm spindle speed for standard read/write times."},{"feature":"AMD Radeon R5 graphics\nIntegrated graphics chipset with shared video memory provides solid image quality for Internet use, movies, basic photo editing and casual gaming."},{"feature":"Built-in speakers\nWaves MaxxAudio is tuned to give you great sound across music, movies, voice and games."},{"feature":"Weighs 7.36 lbs. and measures 1.1\" thin\nCompact power to go, so there's no need to compromise on visual real estate or gaming power to gain portability. 4-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"1 USB 3.0 port maximizes the latest high-speed devices\nAlso includes 2 USB 2.0 ports to connect more accessories and peripherals. The USB 3.0 port is backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD, SDHC and SDXC memory card formats."},{"feature":"Wireless and wired network connectivity\nBuilt-in high-speed wireless LAN connects to your network or hotspots on the most common Wi-Fi standards. The Fast Ethernet LAN port also lets you plug into wired networks."},{"feature":"Built-in HD webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Full keyboard with 10-key numeric keypad\nType comfortably, input numbers quickly and maneuver through games with ease. Precision touchpad for simple navigation."},{"feature":"DVD/CD burner\nReads and writes to a variety of media formats, including DVD+R/RW, DVD-R/RW and CD-R/RW."},{"feature":"Basic software package included\nTrial of Microsoft Office."},{"feature":"AMD, AMD Arrow logo and combinations thereof are trademarks of Advanced Micro Devices, Inc."}],"customerReviewAverage":3.50,"customerReviewCount":10},{"name":"Dell - 8x External USB DVDRW/CD-RW Drive - Black","longDescription":"Burn DVDs and CDs with this Dell USB DVD/RW drive. Plug it into your computer's USB port to play and burn discs or to load new software onto the hard drive. This slim Dell USB DVD/RW drive fits into a tote bag, and it draws power directly from the computer's USB port for hassle-free operation.","salePrice":39.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Multiformat support\nFor CD-ROM, CD-R, CD-RW, DVD-ROM, DVD-R, DVD-RAM, DVD-RW, DVD+RW, DVD+R, DVD+R DL, DVD-R DL, M-DISC media."},{"feature":"8x maximum DVD+R and DVD-R write speed\nFor fast disc burning."},{"feature":"8x maximum DVD+RW rewrite speed\n6x maximum DVD-RW rewrite speed."},{"feature":"0.75MB cache buffer and Automatic Buffer Under Run Error Protection\nHelp eliminate errors for smooth disc burns."},{"feature":"High-speed USB 2.0 interface\nFor fast, reliable operation."}],"customerReviewAverage":4.60,"customerReviewCount":404},{"name":"Dell - Inspiron 2-in-1 13.3\" Touch-Screen Laptop - Intel Core i5 - 4GB Memory - 500GB Hard Drive - Silver","longDescription":"Dell Inspiron Convertible 2-in-1 Laptop: With its 13.3\" multitouch screen, this laptop makes it easy to swipe through apps and programs. The convertible design lets you effortlessly switch between laptop and tablet modes depending on your needs. Plus, the HDMI output lets you connect your HDTV or other high-definition display.","salePrice":598.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"13.3\" multitouch screen\nTap, touch and glide through features. TrueLife and IPS (in-plane switching) technologies offer wide viewing angles and clear images. Typical 1366 x 768 HD resolution."},{"feature":"6th Gen Intel&#174; Core&#8482; i5-6200U mobile processor\nUltra-low-voltage platform. Dual-core, four-way processing provides maximum high-efficiency power to go. Intel Turbo Boost Technology delivers dynamic extra power when you need it."},{"feature":"4GB system memory for basic multitasking\nAdequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once."},{"feature":"500GB hard drive for serviceable file storage space\nHolds your growing collection of digital photos, music and videos."},{"feature":"Convertible design\nLets you quickly switch between laptop and tablet modes."},{"feature":"Intel&#174; HD Graphics 520\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Weighs 3.66 lbs. and measures 0.8\" thin\nUltrathin and ultralight for maximum portability, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"2 USB 3.0 ports maximize the latest high-speed devices\nUSB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds). Also includes 1 additional USB port."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD and MMC memory card formats."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity (1x1, 433 Mbps)\nConnect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N (150 Mbps). Backward-compatible with all other Wi-Fi networks and hotspots."},{"feature":"Built-in webcam\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":3.80,"customerReviewCount":4},{"name":"Dell - Inspiron 13 7359 2-in-1 13.3\" Touch-Screen Laptop - Intel Core i3 - 4GB Memory - 1TB Hard Drive - Gold","longDescription":"Enjoy powerful computing with this Dell Inspiron laptop. This 13.3-inch laptop gives you a powerful i3 processor so that you can complete a variety of tasks, and its 4GB of RAM and 1TB hard drive deliver outstanding reliability and responses. The included Windows 10 Home edition operating system means this Dell Inspiron laptop stays in tune with the latest technology.","salePrice":629.99,"percentSavings":"0.0","condition":"New","features":[{"feature":"Windows 10 operating system\nWindows 10 brings back the Start Menu from Windows 7 and introduces new features, like the Edge Web browser that lets you markup Web pages on your screen. Learn more &#8250;"},{"feature":"13.3\" Full HD multitouch screen\nCapacitive display responds to finger touches or optional digitizer stylus. 1920 x 1080 resolution. IPS technology for wide viewing angles."},{"feature":"6th Gen Intel&#174; Core&#8482; i3-6100U mobile processor\nSmart dual-core, four-way processing performance for HD-quality computing."},{"feature":"4GB system memory for basic multitasking\nAdequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once."},{"feature":"1TB hard drive for ample file storage space\nHolds a significant collection of digital photos, music, HD videos and DVD-quality movies."},{"feature":"360&#176; flip-and-fold design\nOffers four versatile modes &#8212; laptop, tablet, tent and stand."},{"feature":"Intel&#174; HD Graphics 520\nOn-processor graphics with shared video memory provide everyday image quality for Internet use, basic photo editing and casual gaming."},{"feature":"Weighs 3.66 lbs. and measures 0.75\" thin\nUltrathin and ultralight for maximum portability, featuring a smaller screen size and omitting the DVD/CD drive to achieve the compact form factor. 3-cell lithium-ion battery."},{"feature":"Bluetooth interface syncs with compatible devices\nWirelessly transfer photos, music and other media between the laptop and your Bluetooth-enabled cell phone or MP3 player, or connect Bluetooth wireless accessories."},{"feature":"3 USB 3.0 ports maximize the latest high-speed devices\n1 of the ports features PowerShare to power USB devices, even while the laptop is off. USB 3.0 ports are backward-compatible with USB 2.0 devices (at 2.0 speeds)."},{"feature":"HDMI output expands your viewing options\nConnect to an HDTV or high-def monitor to set up two screens side by side or just see more of the big picture."},{"feature":"Built-in media reader for simple photo transfer\nSupports SD and MMC memory card formats."},{"feature":"Next-Gen Intel&#174; Wireless-AC connectivity (1x1, 433 Mbps)\nConnect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N (150 Mbps). Backward-compatible with all other Wi-Fi networks and hotspots."},{"feature":"Built-in HD webcam with stereo microphone\nMakes it easy to video chat with family and friends or teleconference with colleagues over Skype or other popular applications."},{"feature":"LED-backlit keyboard for easy typing in dim or dark conditions\nIsland-style keyboard with chiclet keys. Buttonless touchpad pointing device with multitouch control."},{"feature":"Additional ports\nMicrophone-in/headphone-out combo jack."},{"feature":"Note: This laptop does not include a built-in DVD/CD drive."},{"feature":"Intel, Pentium, Celeron, Core, Atom, Ultrabook, Intel Inside and the Intel Inside logo are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries."}],"customerReviewAverage":3,"customerReviewCount":3},{"name":"Dell - Inspiron 7559 Laptop - Intel Core i7 - 8GB Memory - 1TB+8GB Hybrid Hard Drive - Black","longDescription":"Dell Inspiron 7559 Laptop: Enhance your work or play with the performance of this Dell Inspiron notebook. The 6th Generation Intel i7 Quad-Core processors and NVIDIA GeForce GTX 960M provide high performance for multitask processing. Stream videos and play games at high settings with the high fps rates and 10-hour battery life of this Dell Inspiron notebook.","salePrice":848.99,"percentSavings":"0.0","condition":"New","features":[],"customerReviewAverage":4.20,"customerReviewCount":36}]}